[{"KodeMK":"FI7001","BahanKajian":"Konsep digital, model dan strategi komunikasi, penelusuran, dan kolaborasi digital secara efektif dan positif","Kedalaman":"Express"},{"KodeMK":"FI7001","BahanKajian":"Pemanfaatan digital tools","Kedalaman":"Express"},{"KodeMK":"FI7001","BahanKajian":"Prinsip-prinsip literasi data, artificial intellegence, machine learning dan deep learning","Kedalaman":"Express"},{"KodeMK":"FI7001","BahanKajian":"Pemanfaatan AI untuk riset dan penulisan karya ilmiah","Kedalaman":"Express"},{"KodeMK":"FI7001","BahanKajian":"Integritas dan etika akademik","Kedalaman":"Express"},{"KodeMK":"FI7001","BahanKajian":"Integritas dan etika dalam riset, proyek. dan publikasi ilmiah","Kedalaman":"Express"},{"KodeMK":"FI7002","BahanKajian":"Nature dan tujuan penelitian, konsep dan elemen metodologi penelitian","Kedalaman":"Express"},{"KodeMK":"FI7002","BahanKajian":"Penentuan topik penelitian, identifikasi dan perumusan masalah, kebaruan dan/atau nilai inovatif penelitian","Kedalaman":"Express"},{"KodeMK":"FI7002","BahanKajian":"Research question, penentuan hipotesa. perancangan penelitian","Kedalaman":"Express"},{"KodeMK":"FI7002","BahanKajian":"Desain eksperimen, konsep variabel bebas dan variabel terikat atau metode oemerolahan data lainnva sesuai dengan nature keilmuannva","Kedalaman":"Express"},{"KodeMK":"FI7002","BahanKajian":"Sampling, sample, sampling erro,; sample si=e, karakteristik sample yang baik dan konsiderasi praktis dalam sampling.","Kedalaman":"Express"},{"KodeMK":"FI7002","BahanKajian":"Pengolahan data, analisis, pembahasan, dan kesimpulan","Kedalaman":"Express"},{"KodeMK":"FI7002","BahanKajian":"Penyusunan laporan ilmiah","Kedalaman":"Express"},{"KodeMK":"FI7003","BahanKajian":"Struktur, batas dan wewenang ilmu pengetahuan, agama. Express teknologi, seni maupun ilmu sosial dan kemasyarakatan. Interaksi antar domain yang mempengaruhi penelitian ilmiah, termasuk kriteria demarkasi, serta pengenalan kecerdasan buatan dan dampaknya pada praktek ilmiah","Kedalaman":"Express"},{"KodeMK":"FI7003","BahanKajian":"Filsafat ilmu, sejarah, dan proses pengembangan ilmu pengetahuan","Kedalaman":"Express"},{"KodeMK":"FI7003","BahanKajian":"Kesamaan dan perbedaan dalam filsafat pengembangan keilmuan antara hard science, ilmu sosial, seni, dan teknologi, serta pertanyaan dan debat filosofis yang relevan dengan setiap disiplin ilmiah.","Kedalaman":"Express"},{"KodeMK":"FI7003","BahanKajian":"Metode pengembangan ilmu pengetahuan berbasis eksperimen, teori ataupun simulasi/berbasis teknologi (termasuk kecerdasan buatan)","Kedalaman":"Express"},{"KodeMK":"FI7003","BahanKajian":"Etika dalam pengembangan ilmu pengetahuan dan teknologi","Kedalaman":"Express"},{"KodeMK":"FI7003","BahanKajian":"Rambu-rambu dan batasan dalam pengembangan keilmuan dalam kaitannya dengan agama serta nilai-nilai kemasyarakatan","Kedalaman":"Express"},{"KodeMK":"FI7003","BahanKajian":"Filsafat sains dan artificial intelligence, perkembangan teknologi AI dalam memengaruhi praktik dan metodologi ilmiah tradisional serta imolikasi filosofis dan etisnya.","Kedalaman":"Express"},{"KodeMK":"FI7004","BahanKajian":"Mata kuliah Ujian Kualifikasi merupakan ujian yang berisi konsep-konsep serta prinsip-prinsip dasar yang dijadikan landasan dalam pengerjaan rencana penelitian yang akan dilakukan selama program doktoral.","Kedalaman":"Express"},{"KodeMK":"FI7005","BahanKajian":"Penyusunan proposal dilakukan di bawah bimbingan tim promotor program doktoral sesuai dengan ketentuan peraturan akademik ITB.","Kedalaman":"Express"},{"KodeMK":"FI7005","BahanKajian":"Konten Proposal Penelitian harus mengikuti format yang ditetapkan oleh ITB yang juga harus menjelaskan tentang topik penelitian, originalitas, metoda pengerjaan, serta target penelitian yang eksplisit dan jelas disertai dengan waktu penyelesaian untuk setiap tahapan penelitian yang dilakukan.","Kedalaman":"Express"},{"KodeMK":"FI7005","BahanKajian":"Target capaian penelitian setidaknya harus dibagi dalam 25%, 50%, 75% dan 100% yang masing-masing berkesesuaian dengan matakuliah Penelitian Doktoral I, Penelitian Doktoral II, Penelitian Doktoral III, dan Penelitian Doktoral IV.","Kedalaman":"Express"},{"KodeMK":"FI8001","BahanKajian":"Pada Penelitian Doktoral I, mahasiswa melakukan penelitian sesuai dengan rencana penelitian yang tercantum pada Proposal Penelitian dan melakukan diskusi secara berkala dengan tim pembimbing.","Kedalaman":"Expert"},{"KodeMK":"FI8001","BahanKajian":"Penelitian Doktoral I ditargetkan mencapai 25% dari keseluruhan penelitian atau sesuai dengan target capaian penelitian yang telah disepakati oleh tim pembimbing yang tercantum dalam Proposal Penelitian.","Kedalaman":"Expert"},{"KodeMK":"FI8001","BahanKajian":"Di akhir semester atau pada waktu yang ditetapkan oleh Prodi, mahasiswa wajib menyampaikan capaian penelitiannya dalam bentuk laporan dan dilanjutkan dengan Seminar Kemajuan I.","Kedalaman":"Expert"},{"KodeMK":"FI8003","BahanKajian":"Penelitian Doktoral II merupakan kelanjutan dari Penelitian Doktoral I. Pada Penelitian Doktoral II, mahasiswa melakukan penelitian sesuai dengan rencana penelitian yang tercantum pada Proposal Penelitian dan melakukan diskusi secara berkala dengan tim pembimbing.","Kedalaman":"Expert"},{"KodeMK":"FI8003","BahanKajian":"Penelitian Doktoral II ditargetkan mencapai 50% dari keseluruhan penelitian atau sesuai dengan target capaian penelitian yang telah disepakati oleh tim pembimbing yang tercantum dalam Proposal Penelitian.","Kedalaman":"Expert"},{"KodeMK":"FI8003","BahanKajian":"Di akhir semester atau pada waktu yang ditetapkan oleh Prodi, mahasiswa wajib menyampaikan capaian penelitiannya dalam bentuk laporan dan dilanjutkan dengan Seminar Kemajuan II.","Kedalaman":"Expert"},{"KodeMK":"FI9001","BahanKajian":"Penelitian Doktoral III merupakan kelanjutan dari Penelitian Doktoral II. Pada Penelitian Doktoral III, mahasiswa melakukan penelitian sesuai dengan rencana penelitian yang tercantum pada Proposal Penelitian dan melakukan diskusi secara berkala dengan tim pembimbing.","Kedalaman":"Expert"},{"KodeMK":"FI9001","BahanKajian":"Penelitian Doktoral III ditargetkan mencapai 75% dari keseluruhan penelitian atau sesuai dengan target capaian penelitian yang telah disepakati oleh tim pembimbing yang tercantum dalam Proposal Penelitian.","Kedalaman":"Expert"},{"KodeMK":"FI9001","BahanKajian":"Di akhir semester atau pada waktu yang ditetapkan oleh Prodi, mahasiswa wajib menyampaikan capaian penelitiannya dalam bentuk laporan dan dilanjutkan dengan Seminar Kemajuan III.","Kedalaman":"Expert"},{"KodeMK":"FI9003","BahanKajian":"Penelitian Doktoral IV merupakan kelanjutan dari Penelitian Doktoral III. Pada Penelitian Doktoral IV, mahasiswa melakukan penelitian sesuai dengan rencana penelitian yang tercantum pada Proposal Penelitian dan melakukan diskusi secara berkala dengan tim pembimbing.","Kedalaman":"Expert"},{"KodeMK":"FI9003","BahanKajian":"Penelitian Doktoral IV ditargetkan mencapai 100% dari keseluruhan penelitian atau sesuai dengan target capaian penelitian yang telah disepakati oleh tim pembimbing yang tercantum dalam Proposal Penelitian.","Kedalaman":"Expert"},{"KodeMK":"FI9003","BahanKajian":"Di akhir semester atau pada waktu yang ditetapkan oleh Prodi, mahasiswa wajib menuliskan disertasinya dalam bentuk Buku Disertasi.","Kedalaman":"Expert"},{"KodeMK":"FI8002","BahanKajian":"Mata kuliah Seminar Kemajuan I ini merupakan matakuliah yang terkait erat dengan Penelitian Doktor I.","Kedalaman":"Expert"},{"KodeMK":"FI8002","BahanKajian":"Pada mata kuliah ini, hasil yang didapatkan dari Penelitian Doktoral I yang telah dibuat dalam bentuk laporan kemudian dipresentasikan di depan tim penguji dan pembimbing yang dibentuk oleh Prodi","Kedalaman":"Expert"},{"KodeMK":"FI8004","BahanKajian":"Mata kuliah Seminar Kemajuan II ini merupakan matakuliah yang terkait erat dengan Penelitian Doktor II.","Kedalaman":"Expert"},{"KodeMK":"FI8004","BahanKajian":"Pada mata kuliah ini, hasil yang didapatkan dari Penelitian Doktoral II yang telah dibuat dalam bentuk laporan kemudian dipresentasikan di depan tim penguji dan pembimbing yang dibentuk oleh Prodi","Kedalaman":"Expert"},{"KodeMK":"FI9002","BahanKajian":"Mata kuliah Seminar Kemajuan III ini merupakan matakuliah yang terkait erat dengan Penelitian Doktor III.","Kedalaman":"Expert"},{"KodeMK":"FI9002","BahanKajian":"Pada mata kuliah ini, hasil yang didapatkan dari Penelitian Doktoral III yang telah dibuat dalam bentuk laporan kemudian dipresentasikan di depan tim penguji dan pembimbing yang dibentuk oleh Prodi","Kedalaman":"Expert"},{"KodeMK":"FI9004","BahanKajian":"Mata kuliah Penulisan Disertasi merupakan salah satu tahap terakhir penyelesaian program doktor sebelum sidang doktor yang dibimbing oleh tim pembimbing program doktoral.","Kedalaman":"Expert"},{"KodeMK":"FI9004","BahanKajian":"Buku disertasi berisi semua aspek penelitian yang telah direncanakan dalam Proposal Penelitian, termasuk metode penelitian, hasil penelitian, semua luaran penelitian, serta semua aspek penelitian yang telah dilakukan selama mahasiswa mengikuti program doktoral.","Kedalaman":"Expert"},{"KodeMK":"FI9005","BahanKajian":"Sidang Doktor merupakan matakuliah yang berupa ujian komprehensif untuk mempertahankan hasil-hasil penelitian yang telah ditulis dalam buku disertasi.","Kedalaman":"Expert"},{"KodeMK":"FI7006","BahanKajian":"Mata kuliah ini berupa penelitian mandiri terpantau di bawah bimbingan seorang dosen dengan topik sesuai pilihan mahasiswa yang disepakati oleh dosen pembimbing studi khusus.","Kedalaman":"Expert"},{"KodeMK":"FI7006","BahanKajian":"Tema studi khusus ini tidak boleh sama dengan tema Studi Khusus II. Untuk tema studi khusus yang sama dengan tema studi khusus yang pernah diambil sebelumnya, maka luaran matakulah ini harus meningkat secara signifikan dan berjenjang.","Kedalaman":"Expert"},{"KodeMK":"FI7006","BahanKajian":"Tema studi khusus ini tidak boleh merupakan bagian langsung dari disertasi, tapi diperbolehkan berupa tema yang mendukung disertasi atau tema yang dapat membantu mahasiswa memperluas pengetahuan dalam bidang fisika dalam mencapai tujuan akademiknya.","Kedalaman":"Expert"},{"KodeMK":"FI7007","BahanKajian":"Mata kuliah ini berupa penelitian mandiri terpantau di bawah bimbingan seorang dosen dengan topik sesuai pilihan mahasiswa yang disepakati oleh dosen pembimbing studi khusus.","Kedalaman":"Expert"},{"KodeMK":"FI7007","BahanKajian":"Tema studi khusus ini tidak boleh sama dengan tema Studi Khusus I. Untuk tema studi khusus yang sama dengan tema studi khusus yang pernah diambil sebelumnya, maka luaran matakulah ini harus meningkat secara signifikan dan berjenjang.","Kedalaman":"Expert"},{"KodeMK":"FI7007","BahanKajian":"Tema studi khusus ini tidak boleh merupakan bagian langsung dari disertasi, tapi diperbolehkan berupa tema yang mendukung disertasi atau tema yang dapat membantu mahasiswa memperluas pengetahuan dalam bidang fisika dalam mencapai tujuan akademiknya.","Kedalaman":"Expert"},{"KodeMK":"FI8005","BahanKajian":"Prinsip-prinsip penulisan artikel ilmiah","Kedalaman":"Explore"},{"KodeMK":"FI8005","BahanKajian":"Struktur dan komponen artikel ilmiah","Kedalaman":"Express"},{"KodeMK":"FI8005","BahanKajian":"Literatur dan referensi","Kedalaman":"Express"},{"KodeMK":"FI8005","BahanKajian":"Penggunaan alat dan teknologi pendukung","Kedalaman":"Express"},{"KodeMK":"FI8005","BahanKajian":"Proses peer-review dan publikasi","Kedalaman":"Explore"},{"KodeMK":"FI8005","BahanKajian":"Etika penulisan dan publikasi","Kedalaman":"Express"},{"KodeMK":"FI8005","BahanKajian":"Presentasi dan Komunikasi Ilmiah","Kedalaman":"Expert"},{"KodeMK":"FI8006","BahanKajian":"Mata kuliah ini berupa studi mandiri terpantau untuk suatu topik bersifat interdisiplin yang diperlukan dalam penelitian disertasi.","Kedalaman":"Expert"},{"KodeMK":"FI8006","BahanKajian":"Topik harus berbeda dengan topik pada matakuliah Studi Interdisiplin II dan bukan merupakan bagian langsung dari penelitian disertasinya","Kedalaman":"Expert"},{"KodeMK":"FI8007","BahanKajian":"Mata kuliah ini berupa studi mandiri terpantau untuk suatu topik bersifat interdisiplin yang diperlukan dalam penelitian disertasi.","Kedalaman":"Expert"},{"KodeMK":"FI8007","BahanKajian":"Topik harus berbeda dengan topik pada matakuliah Studi Interdisiplin I dan bukan merupakan bagian langsung dari penelitian disertasinya","Kedalaman":"Expert"},{"KodeMK":"FI7008","BahanKajian":"Mata kuliah ini adalah mata kuliah yang dibuka selama masa transisi kurikulum","Kedalaman":"Expert"},{"KodeMK":"FI7008","BahanKajian":"Dirancang khusus antara mahasiswa dan dosen pembimbing","Kedalaman":"Expert"},{"KodeMK":"FI7009","BahanKajian":"Mata kuliah ini adalah mata kuliah yang dibuka selama masa transisi kurikulum","Kedalaman":"Expert"},{"KodeMK":"FI7009","BahanKajian":"Dirancang khusus antara mahasiswa dan dosen pembimbing","Kedalaman":"Expert"},{"KodeMK":"FI8008","BahanKajian":"Mata kuliah ini adalah mata kuliah yang dibuka selama masa transisi kurikulum","Kedalaman":"Expert"},{"KodeMK":"FI8008","BahanKajian":"Dirancang khusus antara mahasiswa dan dosen pembimbing","Kedalaman":"Expert"},{"KodeMK":"FI8009","BahanKajian":"Mata kuliah ini adalah mata kuliah yang dibuka selama masa transisi kurikulum","Kedalaman":"Expert"},{"KodeMK":"FI8009","BahanKajian":"Dirancang khusus antara mahasiswa dan dosen pembimbing","Kedalaman":"Expert"},{"KodeMK":"FI9006","BahanKajian":"Mata kuliah ini adalah mata kuliah yang dibuka selama masa transisi kurikulum","Kedalaman":"Expert"},{"KodeMK":"FI9006","BahanKajian":"Dirancang khusus antara mahasiswa dan dosen pembimbing","Kedalaman":"Expert"},{"KodeMK":"FI9007","BahanKajian":"Mata kuliah ini adalah mata kuliah yang dibuka selama masa transisi kurikulum","Kedalaman":"Expert"},{"KodeMK":"FI9007","BahanKajian":"Dirancang khusus antara mahasiswa dan dosen pembimbing","Kedalaman":"Expert"}]