[{"KodeMK":"FI5081","CPMK":"Mahasiswa mampu memahami vektor dan matriks serta dapat mengaplikasikannya pada persoalan fisika.","KodeCPL":"CPL 2"},{"KodeMK":"FI5081","CPMK":"Mahasiswa mampu menyelesaikan persoalan nilai eigen untuk kasus sederhana.","KodeCPL":"CPL 3"},{"KodeMK":"FI5081","CPMK":"Mahasiswa dapat menggunakan sistem koordinat ortogonal","KodeCPL":"CPL 3"},{"KodeMK":"FI5081","CPMK":"Mahasiswa mampu memahami fungsi peubah banyak, turunan parsial, integral lipat dan aplikasinya","KodeCPL":"CPL 3"},{"KodeMK":"FI5081","CPMK":"Mahasiswa dapat menggunakan kalkulus vektor dalam menyelesaikan persoalan fisika.","KodeCPL":"CPL 2"},{"KodeMK":"FI5081","CPMK":"Mahaiswa mampu memahami konsep bilangan kompleks dan aplikasinya di fisika.","KodeCPL":"CPL 3"},{"KodeMK":"FI5081","CPMK":"Mahasiswa mengenal metode untuk memecahkan persamaan diferensial sederhana.","KodeCPL":"CPL 3"},{"KodeMK":"FI5081","CPMK":"Mahasiswa dapat menyatakan prinsip matematika dalam fisika dalam bentuk tulisan dan lisan","KodeCPL":"CPL 6"},{"KodeMK":"FI5082","CPMK":"Mahasiswa mampu memahami prinsip mekanika partikel dan aplikasinya pada sistem gaya sentral dan gerak planet.","KodeCPL":"CPL 2"},{"KodeMK":"FI5082","CPMK":"Mahasiswa mampu memahami mekanika sistem partikel dan benda tegar.","KodeCPL":"CPL 2"},{"KodeMK":"FI5082","CPMK":"Mahasiswa mengenal formulasi Lagrange pada mekanika klasik dan dapat menggunakan untuk sistem-sistem sederhana.","KodeCPL":"CPL 3"},{"KodeMK":"FI5082","CPMK":"Mahasiswa mampu memahami konsep fluida statik dan dinamik.","KodeCPL":"CPL 2"},{"KodeMK":"FI5082","CPMK":"Mahasiswa dapat memahami kinetika dan dinamika termal pada sistem gas ideal.","KodeCPL":"CPL 2"},{"KodeMK":"FI5082","CPMK":"Mahasiswa mengenal formulasi fisika statistik pada sistem gas.","KodeCPL":"CPL 2"},{"KodeMK":"FI5082","CPMK":"Mahasiswa dapat menyatakan prinsip fisika klasik dalam bentuk tulisan dan lisan","KodeCPL":"CPL 6"},{"KodeMK":"FI5083","CPMK":"Mahasiswa mampu memahami konsep elektrostatika dan melakukan perhitungan pada sistem-sistem sederhana.","KodeCPL":"CPL 3"},{"KodeMK":"FI5083","CPMK":"Mahasiswa mampu memahami konsep magnetostatika dan melakukan perhitungan pada sistem-sistem sederhana.","KodeCPL":"CPL 3"},{"KodeMK":"FI5083","CPMK":"Mahasiswa mengenal fenomena medan elektromagnetik bergantung waktu dan persamaan Maxwell.","KodeCPL":"CPL 2"},{"KodeMK":"FI5083","CPMK":"Mahasiswa dapat memahami fenomena gelombang, baik mekanik maupun elektromagnetik.","KodeCPL":"CPL 2"},{"KodeMK":"FI5083","CPMK":"Mahasiswa dapat menyatakan prinsip fisika klasik dalam bentuk tulisan dan lisan","KodeCPL":"CPL 6"},{"KodeMK":"FI5084","CPMK":"Mahasiswa mampu memahami konsep teori relativitas khusus","KodeCPL":"CPL 2"},{"KodeMK":"FI5084","CPMK":"Mahasiswa mampu memahami konsep dualisme partikel gelombang","KodeCPL":"CPL 2"},{"KodeMK":"FI5084","CPMK":"Mahasiswa mampu memahami konsep kuantisasi Bohr dan aplikasinya pada atom hidrogen.","KodeCPL":"CPL 2"},{"KodeMK":"FI5084","CPMK":"Mahasiswa mengenal konsep fisika kuantum dan dapat memecahkan persamaan Schrodinger satu dimensi untuk potensial sederhana.","KodeCPL":"CPL 3"},{"KodeMK":"FI5084","CPMK":"Mahasiswa dapat menyatakan prinsip fisika modern dalam bentuk tulisan dan lisan","KodeCPL":"CPL 6"},{"KodeMK":"FI5085","CPMK":"Mahasiswa mampu memahami filosofi pendidikan dan pengajaran","KodeCPL":"CPL 1"},{"KodeMK":"FI5085","CPMK":"Mahasiswa mampu memahami dan menerapkan metode ilmiah dalam sains","KodeCPL":"CPL 5"},{"KodeMK":"FI5085","CPMK":"Mahasiswa mampu menerapkan berbagai metode dan strategi pengajaran","KodeCPL":"CPL 1"},{"KodeMK":"FI5085","CPMK":"Mahasiswa mampu memahami etika profesi sebagai guru.","KodeCPL":"CPL 1"},{"KodeMK":"FI5085","CPMK":"Mahasiswa dapat menyatakan suatu gagasan ilmiah dalam bentuk tulisan dan lisan","KodeCPL":"CPL 6"},{"KodeMK":"FI5181","CPMK":"Mahasiswa memiliki pengetahuan mengenai metode eksperimen dan pengolahan data","KodeCPL":"CPL 5"},{"KodeMK":"FI5181","CPMK":"Mahasiswa memiliki keterampilan untuk melakukan eksperimen fisika klasik","KodeCPL":"CPL 2"},{"KodeMK":"FI5181","CPMK":"Mahasiswa memiliki keterampilan untuk melakukan eksperimen fisika modern","KodeCPL":"CPL 2"},{"KodeMK":"FI5086","CPMK":"Mahasiswa memahami struktur dan dinamika jagat raya, sistem tata surya, rotasi dan revolusi bumi dan bulan, serta dampaknya bagi kehidupan di  bumi","KodeCPL":"CPL 1"},{"KodeMK":"FI5086","CPMK":"Mahasiswa memahami Bumi sebagai tempat kehidupan, lapisan Bumi, atmosfer Bumi, pengaruh dinamika Bumi terhadap kehidupan, bencana dan mitigasinya","KodeCPL":"CPL 1"},{"KodeMK":"FI5086","CPMK":"Mahasiswa memahami sistem-sistem dasar yang mencirikan makhluk hidup.","KodeCPL":"CPL 1"},{"KodeMK":"FI5086","CPMK":"Mahasiswa mampu memecahkan masalah yang berkaitan dengan lingkungan hidup dan mitigasi bencana","KodeCPL":"CPL 1"},{"KodeMK":"FI5086","CPMK":"Mahasiswa memahami struktur dan dinamika jagat raya, sistem tata surya, rotasi dan revolusi bumi dan bulan, serta dampaknya bagi kehidupan di  bumi","KodeCPL":"CPL 2"},{"KodeMK":"FI5086","CPMK":"Mahasiswa memahami Bumi sebagai tempat kehidupan, lapisan Bumi, atmosfer Bumi, pengaruh dinamika Bumi terhadap kehidupan, bencana dan mitigasinya","KodeCPL":"CPL 2"},{"KodeMK":"FI6181","CPMK":"Mahasiswa mampu merumuskan prinsip-prinsip fisika yang menjadi prinsip kerja berbagai instrumen optik.","KodeCPL":"CPL 2"},{"KodeMK":"FI6181","CPMK":"Mahasiswa mampu memecahkan masalah optik sederhana dengan menerapkan konsep dan prinsip fisika yang relevan.","KodeCPL":"CPL 2"},{"KodeMK":"FI6181","CPMK":"Mahasiwa mampu menunjukkan penerapan optik dalam berbagai bidang ilmu pengetahuan dan teknologi.","KodeCPL":"CPL 5"},{"KodeMK":"FI5182","CPMK":"Mahasiswa mampu menggunakan cara efektif dan efisien dalam mencari literatur yang tersedia","KodeCPL":"CPL 5"},{"KodeMK":"FI5182","CPMK":"Mahasiswa mampu menggunakan teknologi informasi dan komunikasi untuk mendukung pencarian literatur","KodeCPL":"CPL 4"},{"KodeMK":"FI5182","CPMK":"Mahasiswa mampu menggabungkan informasi dari berbagai literatur dalam suatu tulisan","KodeCPL":"CPL 5"},{"KodeMK":"FI5182","CPMK":"Mahasiswa mampu membuat suatu tulisan ilmiah sesuai dengan kaidah yang ditetapkan","KodeCPL":"CPL 6"},{"KodeMK":"FI5182","CPMK":"Mahasiswa mampu melakukan komunikasi suatu tulisan ilmiah melalui presentasi","KodeCPL":"CPL 6"},{"KodeMK":"FI5183","CPMK":"Mahasiswa mampu membahas dan memberikan contoh terkait sains terpadu","KodeCPL":"CPL 5"},{"KodeMK":"FI5183","CPMK":"Mahasiswa mampu memahami prinsip dan metode interdisipliner dalam sains","KodeCPL":"CPL 4"},{"KodeMK":"FI5183","CPMK":"Mahasiswa dapat mengenal perkembangan terbaru sains terpadu","KodeCPL":"CPL 5"},{"KodeMK":"FI5282","CPMK":"Mahasiswa mampu mengenali prinsip-prinsip fisika yang digunakan dalam teknologi","KodeCPL":"CPL 5"},{"KodeMK":"FI5282","CPMK":"Mahasiswa dapat menjelaskan konsep fisika dalam fenomena kehidupan sehari-hari","KodeCPL":"CPL 5"},{"KodeMK":"FI6086","CPMK":"Mahasiswa dapat mengaplikasikan pengetahuan dan keterampilan dalam mengajar fisika di kelas secara optimal","KodeCPL":"CPL 1"},{"KodeMK":"FI6086","CPMK":"Mahasiswa dapat menyusun set alat demonstrasi, eksperimen atau soal ujian","KodeCPL":"CPL 1"},{"KodeMK":"FI6087","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6087","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI5283","CPMK":"Mahasiswa mampu mengkomunikasikan gagasan ilmiah maupun populer secara lisan maupun tulisan dengan baik","KodeCPL":"CPL 6"},{"KodeMK":"FI5283","CPMK":"Mahasiswa memiliki pola pikir yang logis dan sistematis  dalam membuat dan mengkomunikasikan gagasan ilmiah/populer","KodeCPL":"CPL 1"},{"KodeMK":"FI5284","CPMK":"Mahasiswa mampu memahami mengenai dasar-dasar rangkaian listrik","KodeCPL":"CPL 2"},{"KodeMK":"FI5284","CPMK":"Mahasiswa mampu memahami konsep dasar mengenai filter pasif dan aktif","KodeCPL":"CPL 3"},{"KodeMK":"FI5284","CPMK":"Mahasiswa dapat memahami gerbang logika dan rangkaian digital sederhana","KodeCPL":"CPL 2"},{"KodeMK":"FI5284","CPMK":"Mahasiswa dapat mengembangkan rangkaian aplikasi sederhana untuk sistem pengukuran dan kontrol","KodeCPL":"CPL 2"},{"KodeMK":"FI6281","CPMK":"Mahasiswa mampu memahami fungsi laboratorium Fisika dalam kaitannya sebagai sarana pengajaran Fisika.","KodeCPL":"CPL 1"},{"KodeMK":"FI6281","CPMK":"Mahasiswa mampu memahami aturan standar minimal sarana laboratorium berdasarkan berbagai sumber, termasuk peraturan pemerintah.","KodeCPL":"CPL 1"},{"KodeMK":"FI6281","CPMK":"Mahasiswa mampu mengikuti perkembangan teknologi perangkat laboratorium dan dapat menerapkan pada pengembangan modul praktikum yang relevan","KodeCPL":"CPL 5"},{"KodeMK":"FI6281","CPMK":"Mahasiswa mampu menyiapkan konsep manajemen laboratorium yang efektif terkait sarana, SDM dan kegiatan yang berlangsung di laboratorium","KodeCPL":"CPL 1"},{"KodeMK":"FI6281","CPMK":"Mahasiswa mampu merancang dan mengembangkan modul praktikum yang relevan","KodeCPL":"CPL 2"},{"KodeMK":"FI6281","CPMK":"Mahasiswa mampu merancang kegiatan praktikum yang baik","KodeCPL":"CPL 1"},{"KodeMK":"FI6281","CPMK":"Mahasiswa mampu merancang asesmen dari kegiatan praktikum yang sesuai dengan capaian pembelajaran dan menyusun hasil laporan asesmen tersebut.","KodeCPL":"CPL 1"},{"KodeMK":"FI6182","CPMK":"Mahasiswa mampu menganalisis capaian pembelajaran untuk menyusun tujuan pembelajaran dan alur tujuan pembelajaran","KodeCPL":"CPL 1"},{"KodeMK":"FI6182","CPMK":"Mahasiswa mampu menyusun rencana pelaksanaan pembelajaran dan mengembangkan modul ajar","KodeCPL":"CPL 6"},{"KodeMK":"FI6182","CPMK":"Mahasiswa mampu merancang, melaksanakan, dan mengolah berbagai asesmen","KodeCPL":"CPL 1"},{"KodeMK":"FI6182","CPMK":"Mahasiswa mampu melakukan evaluasi terhadap pembelajaran dan asesmen","KodeCPL":"CPL 1"},{"KodeMK":"FI5087","CPMK":"Mampu memahami konsep digital, model dan strategi untuk berkomunikasi, berkolaborasi, melakukan penelusuran, mengkonsumsi, membuat, dan mendistribusikan informasi dalam dunia digital secara efektif dan positif","KodeCPL":"CPL 4"},{"KodeMK":"FI5087","CPMK":"Mampu memanfaatkan digital tools secara efektif dan positif","KodeCPL":"CPL 4"},{"KodeMK":"FI5087","CPMK":"Mampu memahami prinsip-prinsip literasi data, artificial intellegence, machine learning dan deep learning","KodeCPL":"CPL 4"},{"KodeMK":"FI5087","CPMK":"Mampu menghayati, menghormati, dan menegakkan integritas dan etika akademik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5087","CPMK":"Mampu menghayati, menghormati, dan menegakkan integritas dan etika dalam melakukan riset. proyek, dan publikasi ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI5088","CPMK":"Mahasiswa memahami nature dan tujuan penelitian, konsep dan elemen metodologi penelitian","KodeCPL":"CPL 1"},{"KodeMK":"FI5088","CPMK":"Mahasiswa mampu menentukan topik penelitian, mengidentifikasi dan merumuskan masalah, menentukan kebaruan dan/atau nilai inovatif penelitian","KodeCPL":"CPL 1"},{"KodeMK":"FI5088","CPMK":"Mahasiswa mampu menentukan research question, hipotesa, dan merancang penelitian untuk tugas akhir magisternya","KodeCPL":"CPL 1"},{"KodeMK":"FI5088","CPMK":"Mahasiswa mampu merancang eksperimen atau metode pemerolehan data lainnya sesuai dengan nature keilmuannya","KodeCPL":"CPL 5"},{"KodeMK":"FI5088","CPMK":"Mahasiswa mampu mengolah data, menganalisis dan melakukan pembahasan serta kesimpulan dari hasil penelitian yang diperoleh","KodeCPL":"CPL 4"},{"KodeMK":"FI5088","CPMK":"Mahasiswa mampu menyusun suatu laporan ilmiah","KodeCPL":"CPL 6"},{"KodeMK":"FI6085","CPMK":"Mahasiswa mampu mempersiapkan bahan presentasi tesis/projek yang terstruktur, jelas dan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI6085","CPMK":"Mahasiswa mampu menjelaskan hasil akhir tesis/projek akhirnya dengan baik.","KodeCPL":"CPL 6"},{"KodeMK":"FI6081","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6081","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 1"},{"KodeMK":"FI6081","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI6082","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6082","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 1"},{"KodeMK":"FI6082","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI6083","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6083","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 1"},{"KodeMK":"FI6083","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI6084","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6084","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 1"},{"KodeMK":"FI6084","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI5281","CPMK":"Mahasiswa mampu memahami konsep komputasi dalam menyelesaikan persoalan-persoalan fisika.","KodeCPL":"CPL 3"},{"KodeMK":"FI5281","CPMK":"Mahasiswa dapat membuat pemodelan sederhana dari suatu sistem fisis.","KodeCPL":"CPL 4"},{"KodeMK":"FI5281","CPMK":"Mahasiswa mampu membuat implementasi algoritma dalam bahasa pemograman tertentu.","KodeCPL":"CPL 4"},{"KodeMK":"FI5089","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika klasik atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5089","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai fisika klasik secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI6088","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan listrik magnet atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6088","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai listrik magnet secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI6089","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika modern atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6089","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai fisika modern secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI5184","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika matematik atau yang terkait secara mandiri","KodeCPL":"CPL 3"},{"KodeMK":"FI5184","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai fisika matematik secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI5285","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika komputasi atau yang terkait secara mandiri","KodeCPL":"CPL 4"},{"KodeMK":"FI5285","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai fisika komputasi secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI5185","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika yang terkait pengajaran secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5185","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI5186","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika yang terkait pengajaran secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5186","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI5286","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika yang terkait pengajaran secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5286","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 6"},{"KodeMK":"FI5287","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika yang terkait pengajaran secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5287","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 6"}]