[{"KodeMK":"FI1101","CPMK":"Mampu memformulasikan besaran-besaran fisika yang berkaitan dengan gerak benda dalam model fisis menggunakan matematika.","KodeCPL":"CPL 02"},{"KodeMK":"FI1101","CPMK":"Mampu menerapkan konsep/prinsip/hukum terkait kinematika, dinamika dan energi (mekanika Newton) untuk memecahkan persoalan suatu sistem fisis.","KodeCPL":"CPL 03"},{"KodeMK":"FI1101","CPMK":"Mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan masalah-masalah sistem fisis.","KodeCPL":"CPL 09"},{"KodeMK":"FI1201","CPMK":"Mampu memformulasikan besaran-besaran fisika yang berkaitan dengan listrik-magnet kedalam model fisis menggunakan matematika.","KodeCPL":"CPL 02"},{"KodeMK":"FI1201","CPMK":"Mampu menerapkan konsep/prinsip/hukum terkait listrik-magnet untuk memecahkan persoalan suatu sistem fisis.","KodeCPL":"CPL 03"},{"KodeMK":"FI1201","CPMK":"Mampu mendisain dan melaksanakan eksperimen listrik-magnet serta mampu menganalisis dan menginterpretasikan data-data hasil pengukuran","KodeCPL":"CPL 05"},{"KodeMK":"FI1201","CPMK":"Mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan masalah-masalah sistem fisis.","KodeCPL":"CPL 09"},{"KodeMK":"FI1204","CPMK":"Mahasiswa mampu mengoperasikan peralatan eksperimen listrik magnet, optik, dan fisika modern.","KodeCPL":"CPL 05"},{"KodeMK":"FI1204","CPMK":"Mahasiswa mampu melakukan pengambilan, pengolahan, dan interpretasi data dari kegiatan eksperimen.","KodeCPL":"CPL 05"},{"KodeMK":"FI1204","CPMK":"Mahasiswa mampu menyajikan hasil eksperimen dalam bentuk laporan ilmiah.","KodeCPL":"CPL 06"},{"KodeMK":"FI1204","CPMK":"Mahasiswa mampu bekerja secara efektif dalam menjalankan kegiatan eksperimen.","KodeCPL":"CPL 07"},{"KodeMK":"FI1204","CPMK":"Mahasiswa mampu bekerja secara mandiri maupun kelompok dalam melaksanakan kegiatan eksperimen.","KodeCPL":"CPL 07"},{"KodeMK":"FI2101","CPMK":"Mampu menunjukkan kekonvergenan suatu deret serta menetukan fungsi dalam deret pangkat (deret Taylor dan deret Maclaurin).","KodeCPL":"CPL 01"},{"KodeMK":"FI2101","CPMK":"Mampu menetukan bagian real dan imajiner suatu bilangan kompleks serta melakukan operasi pada bilangan kompleks.","KodeCPL":"CPL 01"},{"KodeMK":"FI2101","CPMK":"Mampu menyelesaikan operasi matriks, menyelesaikan persamaan linier dengan reduksi baris serta mampu menetukan nilai eigen dan vektor eigen serta diagonalisasi matriks","KodeCPL":"CPL 01"},{"KodeMK":"FI2101","CPMK":"Mampu menentukan diferensial total suatu persamaa dua peubah atau lebih, meneutkan aturan berantai serta turunan implisit, menetukan nilai maksimum dan minimum dari suatu persamann serta menggunakan pengali Lagrange untuk menyelesaikan permasalahan maksimum dan minimum","KodeCPL":"CPL 02"},{"KodeMK":"FI2101","CPMK":"Mampu menyelesaikan integral lipat dua dan tiga dan mampu mengaplikasikannya.","KodeCPL":"CPL 03"},{"KodeMK":"FI2101","CPMK":"Mampu melakukan perkalian vektor, triple product, turunan vektor, medan, gradien, divergensi, rotasi serta, integral garis, teorema Green, teorema divergensi serta teorema Stoke","KodeCPL":"CPL 04"},{"KodeMK":"FI2101","CPMK":"Mampu menentukan koefisien Fourier, menentukan gungsi ganjil-genap serta mampu mengerjakan transformasi Fourier.","KodeCPL":"CPL 10"},{"KodeMK":"FI2101","CPMK":"Mampu menyelsaikan metode penyelesaian Persamaan Diferensial Biasa (PDB) orde satu dan orde dua","KodeCPL":"CPL 10"},{"KodeMK":"FI2102","CPMK":"Mampu menunjukkan pengetahuan tentang konsep-konsep fisika klasik: dinamika partikel dan system partikel, system osilator harmonik dan gaya sentral.","KodeCPL":"CPL 01"},{"KodeMK":"FI2102","CPMK":"Dapat memformulasi sistem mekanika sederhana ke dalam model fisis dengan menggunakan matematika.","KodeCPL":"CPL 02"},{"KodeMK":"FI2102","CPMK":"Dapat memecahkan masalah sistem mekanika sederhana secara komprehensif dengan menggunakan matematika.","KodeCPL":"CPL 03"},{"KodeMK":"FI2102","CPMK":"Dapat menganalisis sistem mekanika sederhana dengan menggunakan matematika.","KodeCPL":"CPL 04"},{"KodeMK":"FI2103","CPMK":"CO1 Mampu mengidentifikasi suatu fenomena sebagai fenomena klasik atau fenomena modern","KodeCPL":"CPL 01"},{"KodeMK":"FI2103","CPMK":"CO2 Memahami konsep-konsep dan prinsip-prinsip dasar teori relativitas khusus Einstein","KodeCPL":"CPL 02"},{"KodeMK":"FI2103","CPMK":"CO3 Memahami konsep-konsep dan prinsip-prinsip dasar teori kuantum, termasuk mampu menyelesaikan persamaan Schrodinger untuk kasus-kasus sederhana","KodeCPL":"CPL 03"},{"KodeMK":"FI2103","CPMK":"CO4 Memahami konsep-konsep kuantum pada atom dan molekul","KodeCPL":"CPL 04"},{"KodeMK":"FI2104","CPMK":"Mahasiswa memiliki wawasan tentang kerja di laboratorium","KodeCPL":"CPL 05"},{"KodeMK":"FI2104","CPMK":"Mahasiswa mampu menguasai alat praktikum fisika dan melakukan eksperimen","KodeCPL":"CPL 05"},{"KodeMK":"FI2104","CPMK":"Mampu melaporkan hasil karya nya dalam bentuk lisan ataupun tulisan","KodeCPL":"CPL 06"},{"KodeMK":"FI2104","CPMK":"Mampu bekerja secara efektif, baik secara individu maupun dalam grup","KodeCPL":"CPL 07"},{"KodeMK":"FI2105","CPMK":"Mengenal kontribusi penting Fisika pada kehidupan manusia melalui teknologi","KodeCPL":"CPL 01"},{"KodeMK":"FI2105","CPMK":"Mampu menyampaikan buah pikiran dalam bentuk esai secara tulis dan lisan","KodeCPL":"CPL 06"},{"KodeMK":"FI2105","CPMK":"Mampu bekerja sama mengerjakan tugas kelompok","KodeCPL":"CPL 07"},{"KodeMK":"FI2105","CPMK":"Mampu bekerja secara efektif dengan mengumpulkan tugas pada waktunya","KodeCPL":"CPL 07"},{"KodeMK":"FI2105","CPMK":"Memahami, mengekspresikan dan berargumentasi berbasiskan ilmu fisika","KodeCPL":"CPL 09"},{"KodeMK":"FI2105","CPMK":"Menunjukkan sifat dan karakter ilmuwan yang penuh keingintahuan, jujur, skeptik dan objektif.","KodeCPL":"CPL 09"},{"KodeMK":"FI2121","CPMK":"Mampu memahami peran material dalam pengembangan teknologi maju dan kekinian","KodeCPL":"CPL 01"},{"KodeMK":"FI2121","CPMK":"Mampu memahami penyusun materi","KodeCPL":"CPL 01"},{"KodeMK":"FI2121","CPMK":"Mampu memahami bagaimana pembentukan material","KodeCPL":"CPL 01"},{"KodeMK":"FI2121","CPMK":"Mampu memahami prinisp kerja/mekanisme sifat fisis sederhana","KodeCPL":"CPL 02"},{"KodeMK":"FI2121","CPMK":"Mampu menggunakan perumusan sederhana untuk mengoptimasi suatu besaran fisis","KodeCPL":"CPL 02"},{"KodeMK":"FI2151","CPMK":"Memahami aplikasi pemodelan sederhana dan generasi data untuk memecahkan masalah fisika.","KodeCPL":"CPL 03"},{"KodeMK":"FI2151","CPMK":"Mampu mengaplikasikan pemodelan sederhana dan generasi data untuk membantu memecahkan permasalahan fisika, khususnya terkait eksperimen.","KodeCPL":"CPL 04"},{"KodeMK":"FI2151","CPMK":"Mampu mengembangkan pemodelan sederhana dan generasi data untuk membantu memecahkan permasalahan fisika","KodeCPL":"CPL 06"},{"KodeMK":"FI2151","CPMK":"Mampu bekerja efektif, baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI2151","CPMK":"Mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan masalah-masalah sistem fisis.","KodeCPL":"CPL 09"},{"KodeMK":"FI2171","CPMK":"Mampu menjelaskan konsep dasar dan fungsi instrumentasi dalam jaringan","KodeCPL":"CPL 01"},{"KodeMK":"FI2171","CPMK":"Mampu merancang sistem IoT secara terintegrasi","KodeCPL":"CPL 01"},{"KodeMK":"FI2171","CPMK":"Mampu merancang, merekayasa, dan menganalisis sistem instrumentasi berbasis jaringan secara terintegrasi","KodeCPL":"CPL 05"},{"KodeMK":"FI2171","CPMK":"Mampu menganalisis dan menyelesaikan masalah terkait sistem berbasis IoT untuk berbagai aplikasi sistem fisis.","KodeCPL":"CPL 05"},{"KodeMK":"FI2171","CPMK":"Mampu melaporkan hasil karya nya dalam bentuk lisan ataupun tulisan","KodeCPL":"CPL 06"},{"KodeMK":"FI2171","CPMK":"Mampu bekerja secara efektif, baik secara individu maupun dalam grup","KodeCPL":"CPL 07"},{"KodeMK":"FI2201","CPMK":"Mampu menjelaskan keterkaitan fenomena fisis dengan perumusan sifat-sifat fisis dalam konsep dan hukum fisika","KodeCPL":"CPL 01"},{"KodeMK":"FI2201","CPMK":"Mampu mengidentifikasi sistem fisis dari pemodelan matematis dan sebaliknya","KodeCPL":"CPL 02"},{"KodeMK":"FI2201","CPMK":"Mampu memformulasikan sistem fisis sederhana ke dalam persamaan matematis","KodeCPL":"CPL 02"},{"KodeMK":"FI2201","CPMK":"Mampu mendapatkan solusi dari model matematis secara analitis dengan menggunakan metoda matematis yang sesuai","KodeCPL":"CPL 03"},{"KodeMK":"FI2201","CPMK":"Mampu menjelaskan fenomena fisis dari solusi matematis yang diperoleh","KodeCPL":"CPL 04"},{"KodeMK":"FI2201","CPMK":"Mampu mengaplikasikan metoda dan ketrampilan matematis yang diperoleh pada kasus lain yang berbeda atau yang lebih kompleks","KodeCPL":"CPL 10"},{"KodeMK":"FI2202","CPMK":"Mampu menunjukkan hukum dasar elektrostatika dan magnetostatika beserta sifat medan-medan statik ini","KodeCPL":"CPL 01"},{"KodeMK":"FI2202","CPMK":"Mampu menunjukkan konsekuensi dari Persamaan Maxwell dan sifat Gelombang Elektromagnetik","KodeCPL":"CPL 01"},{"KodeMK":"FI2202","CPMK":"Mampu merumuskan medan elektrostatika dari suatu sumber muatan baik di ruang bebas maupun dalam bahan","KodeCPL":"CPL 02"},{"KodeMK":"FI2202","CPMK":"Mampu merumuskan medan magnetostatika dari suatu sumber arus baik di ruang bebas maupun dalam bahan","KodeCPL":"CPL 02"},{"KodeMK":"FI2202","CPMK":"Mampu merumuskan persoalan induksi elektromagnetik","KodeCPL":"CPL 02"},{"KodeMK":"FI2202","CPMK":"Mampu menyelesaikan persoalan elektrostatika maupun magnetostatika di ruang bebas maupun dalam bahan","KodeCPL":"CPL 03"},{"KodeMK":"FI2202","CPMK":"Mampu menyelesaikan persoalan induksi elektromagnetik","KodeCPL":"CPL 03"},{"KodeMK":"FI2202","CPMK":"Mampu memberikan analisis pada solusi persoalan medan elektromagnetik","KodeCPL":"CPL 04"},{"KodeMK":"FI2202","CPMK":"Memiliki pengetahuan dasar mengenai elektrodinamika relativistik","KodeCPL":"CPL 10"},{"KodeMK":"FI2203","CPMK":"Memahami hukum-hukum termodinamika, konsep temperatur, sistem dan besaran termodinamika, teori kinetik gas ideal, siklus pada mesin, zat murni dan relasi Maxwell, sampai pada perubahan fase orde pertama.","KodeCPL":"CPL 01"},{"KodeMK":"FI2203","CPMK":"Mampu menggunakan persamaan keadaan gas ideal dan gas tak ideal untuk memecahkan masalah terkait kalor, kapasitas kalor, dan kalor jenis, energi bebas (Gibbs dan Helmholtz), dan entalpi untuk menganalisis perubahan termodinamika dalam sistem zat murni, serta menggunakan transformasi Legendre dalam relasi Maxwell.","KodeCPL":"CPL 01"},{"KodeMK":"FI2203","CPMK":"Mampu menerapkan hukum-hukum termodinamika untuk menganalisis perubahan kalor menjadi kerja, entropi, prinsip entropi maksimum, dan proses Carnot dalam sistem termal.","KodeCPL":"CPL 02"},{"KodeMK":"FI2203","CPMK":"Mampu menganalisis fase dan perubahan fase (padat, cair, dan gas) dalam berbagai sistem termodinamika, perubahan sifat termodinamika dalam berbagai kondisi fase dan menggunakan konsep-konsep tersebut untuk mencari solusi dalam masalah perubahan fase.","KodeCPL":"CPL 03"},{"KodeMK":"FI2203","CPMK":"Memahami dan memanfaatkan ICT untuk menyelesaikan dan menganalisis permasalahan dalam bidang termodinamika.","KodeCPL":"CPL 04"},{"KodeMK":"FI2204","CPMK":"Mahasiswa mampu merancang, mempersiapkan, melakukan eksperimen pada topik: Fluida, Elektromegnetisme, Termodinamika, Fisika Modern, mengambil data secara benar dalam waktu yang telah ditentukan dengan mengacu pada standar-standar keselamatan bekerja di laboratorium","KodeCPL":"CPL 05"},{"KodeMK":"FI2204","CPMK":"Mahasiswa mampu menganalisis dan menginterpretasi data eksperimen, dan mampu menilai apakah data yang didapat sudah benar atau belum","KodeCPL":"CPL 05"},{"KodeMK":"FI2204","CPMK":"Mahasiswa mampu menampilkan data eksperimen dengan baik, memaparkan hasil dengan jelas, baik dalam laporan tertulis maupun presentasi","KodeCPL":"CPL 06"},{"KodeMK":"FI2204","CPMK":"Mahasiswa mampu melakukan aktifitas riset sederhana secara berkelompok, termasuk di dalamnya merencanakan dan menyiapkan riset tersebut secara rinci","KodeCPL":"CPL 07"},{"KodeMK":"FI2205","CPMK":"Mampu memahami dasar-dasar sistem instrumentasi dalam pengukuran besaran fisis","KodeCPL":"CPL 01"},{"KodeMK":"FI2205","CPMK":"Mampu mengidentifikasi sistem atau metode pengukuran untuk suatu besaran fisis","KodeCPL":"CPL 01"},{"KodeMK":"FI2205","CPMK":"Mampu memahami prinsip kerja dan penggunaan berbagai jenis sensor","KodeCPL":"CPL 01"},{"KodeMK":"FI2205","CPMK":"Mampu mengolah data hasil pengukuran secara deskriptif","KodeCPL":"CPL 05"},{"KodeMK":"FI2205","CPMK":"Mampu merancang sistem instrumentasi sederhana untuk pengukuran sistem fisis","KodeCPL":"CPL 05"},{"KodeMK":"FI2205","CPMK":"Mampu menerapkan metode pengukuran dan instrumentasi dalam berbagai sistem fisis","KodeCPL":"CPL 08"},{"KodeMK":"FI2211","CPMK":"Mahasiswa mampu memahami prinsip dasar Relativitas Khusus Einstein dan Transformasi Koordinat dalam Teori Relativitas Khusus","KodeCPL":"CPL 01"},{"KodeMK":"FI2211","CPMK":"Mahasiswa mampu memahami dan melakukan analisis kinematika terkait dengan Transformasi Lorentz dalam Teori Relativitas Khusus","KodeCPL":"CPL 02"},{"KodeMK":"FI2211","CPMK":"Mahasiswa mampu memahami dan melakukan analisis Energi dan momentum relativistik dalam Teori Relativitas Khusus.","KodeCPL":"CPL 03"},{"KodeMK":"FI2211","CPMK":"Mahasiswa mampu memahami dan melakukan penurunan persamaan dinamika bentuk kovarian beserta analisis solusinya dalam Teori Relativitas Khusus","KodeCPL":"CPL 04"},{"KodeMK":"FI2221","CPMK":"Mengenal gelombang elektromagnetik dan sifat interaksinya dengan bahan","KodeCPL":"CPL 01"},{"KodeMK":"FI2221","CPMK":"Mengenal klasifikasi material berdasarkan sifat magnetiknya","KodeCPL":"CPL 01"},{"KodeMK":"FI2221","CPMK":"Memahami dan dapat menjelaskan fenomena interferensi, difraksi, hamburan dan dispersi","KodeCPL":"CPL 02"},{"KodeMK":"FI2221","CPMK":"Mengetahui dan dapat menjelaskan berbagai aplikasi dari fenomena gelombang dan interaksinya dengan bahan","KodeCPL":"CPL 02"},{"KodeMK":"FI2221","CPMK":"Memahami dan dapat menjelaskan gejala ferromagnetisme dan superkonduktivitas, dan model fenomenologisnya","KodeCPL":"CPL 02"},{"KodeMK":"FI2221","CPMK":"Mengetahui dan dapat menjelaskan berbagai aplikasi dari material magnetik atau yang berkaitan dengan gejala kemagnetan","KodeCPL":"CPL 02"},{"KodeMK":"FI2231","CPMK":"Memahami prinsip-prinsip dasar dan konsep ilmu nanomaterial.","KodeCPL":"CPL 08"},{"KodeMK":"FI2231","CPMK":"Memahami teknik sintesis yang digunakan untuk menghasilkan nanomaterial.","KodeCPL":"CPL 08"},{"KodeMK":"FI2231","CPMK":"Memahami teknik-teknik karakterisasi yang digunakan untuk menganalisis sifat dan struktur nanomaterial.","KodeCPL":"CPL 08"},{"KodeMK":"FI2231","CPMK":"Mampu menjelaskan aplikasi nanomaterial dalam berbagai bidang teknologi seperti di bidang: elektronika, kedokteran, energi, dan ilmu lingkungan.","KodeCPL":"CPL 08"},{"KodeMK":"FI2251","CPMK":"CO1 Mahasiswa mampu untuk menjelaskan konduksi impuls pada sistem syaraf dan menganalisa perpindahan aktif/pasif","KodeCPL":"CPL 01"},{"KodeMK":"FI2251","CPMK":"CO2 Mahasiswa mampu untuk memberikan paparan dan menjelaskan mengenai kontraksi otot yang terjadi karena perubahan kondisi fisik pada otot lurik","KodeCPL":"CPL 01"},{"KodeMK":"FI2251","CPMK":"CO3 Mahasiswa mampu untuk memberikan paparan mengenai struktur dan fungsi dari telinga pada proses pendengaran","KodeCPL":"CPL 01"},{"KodeMK":"FI2251","CPMK":"CO12 Mahasiswa mampu menerapkan metodologi fisika dalam bidang biologi","KodeCPL":"CPL 01"},{"KodeMK":"FI2251","CPMK":"CO4 Mahasiswa mampu untuk memberikan paparan mengenai struktur dan fungsi dari mata pada proses pengelihatan","KodeCPL":"CPL 02"},{"KodeMK":"FI2251","CPMK":"CO5 Mahasiswa mampu untuk memberikan paparan mengenai struktur dan fungsi dari jantung pada sistem sirkulasi darah","KodeCPL":"CPL 02"},{"KodeMK":"FI2251","CPMK":"CO6 Mahasiswa mampu untuk memberikan paparan mengenai struktur dan fungsi dari sistem pernafasan","KodeCPL":"CPL 02"},{"KodeMK":"FI2251","CPMK":"CO7 Mahasiswa mampu untuk memberikan paparan mengenai radiasi ultrasonik dan radiasi elektromagnetik dan efeknya pada sistem biologi.","KodeCPL":"CPL 03"},{"KodeMK":"FI2251","CPMK":"CO8 Mahasiswa mampu untuk memberikan paparan mengenai struktur dan fungsi dari biomolekul","KodeCPL":"CPL 03"},{"KodeMK":"FI2251","CPMK":"CO9 Mahasiswa mampu memodelkan kerja dari paru-paru","KodeCPL":"CPL 04"},{"KodeMK":"FI2251","CPMK":"CO10 Mahasiswa mampu menginterpretasikan data tingkat pendengaran berdasarkan pure tone audiometer","KodeCPL":"CPL 04"},{"KodeMK":"FI2251","CPMK":"CO11 Mahasiswa mampu menentukan parameter dari kerja jantung","KodeCPL":"CPL 04"},{"KodeMK":"FI2251","CPMK":"CO13 Dapat memperluas wawasan ilmu dan metodologi fisika dalam bidang biologi","KodeCPL":"CPL 08"},{"KodeMK":"FI2271","CPMK":"Mampu menjelaskan konsep dasar sensor dan aktuator.","KodeCPL":"CPL 01"},{"KodeMK":"FI2271","CPMK":"Mampu menghitung menganalisis parameter-parameter dalam sensor dan aktuator.","KodeCPL":"CPL 01"},{"KodeMK":"FI2271","CPMK":"Mampu merancang, merekayasa, dan menganalisis sensor dan aktuator sesuai kebutuhan.","KodeCPL":"CPL 05"},{"KodeMK":"FI2271","CPMK":"Mampu menganalisis dan mengambil keputusan dalam menyelesaikan masalah terkait sensor dan aktuator.","KodeCPL":"CPL 05"},{"KodeMK":"FI2271","CPMK":"Mampu melaporkan hasil karya nya dalam bentuk lisan ataupun tulisan","KodeCPL":"CPL 06"},{"KodeMK":"FI2271","CPMK":"Mampu bekerja secara efektif, baik secara individu maupun dalam grup","KodeCPL":"CPL 07"},{"KodeMK":"FI2272","CPMK":"Mahasiswa mampu memahami dan menjelaskan konsep, prinsip, dan teknik dasar dalam visualisasi data dan pemrosesan citra pada hasil pengukuran fisis.","KodeCPL":"CPL 03"},{"KodeMK":"FI2272","CPMK":"Mahasiswa mampu menerapkan teknik visualisasi data dan pemrosesan citra yang tepat untuk berbagai jenis data dan konteks fisika.","KodeCPL":"CPL 04"},{"KodeMK":"FI2272","CPMK":"Mahasiswa mampu melakukan analisis data dan pemrosesan citra dan menarik kesimpulan fisis berdasarkan visualisasi data yang telah dibuat.","KodeCPL":"CPL 04"},{"KodeMK":"FI2272","CPMK":"Mahasiswa mampu berpikir kritis dan logis dalam memilih dan menerapkan teknik visualisasi data yang tepat, serta dalam menganalisis dan menafsirkan data dan citra yang telah diolah.","KodeCPL":"CPL 06"},{"KodeMK":"FI2272","CPMK":"Mahasiswa mampu menyajikan dan melaporkan hasil visualisasi data dan pemrosesan citra dalam bentuk lisan atau tulisan yang efektif dan menarik.","KodeCPL":"CPL 06"},{"KodeMK":"FI2291","CPMK":"Memahami kebutuhan energi bagi semua makhluk hidup dan dalam semua sektor kehidupan manusia.","KodeCPL":"CPL 01"},{"KodeMK":"FI2291","CPMK":"Keberhasilan terkini dalam pengelolaan lingkungan.","KodeCPL":"CPL 01"},{"KodeMK":"FI2291","CPMK":"Keterkaitan energi dan lingkungan.","KodeCPL":"CPL 01"},{"KodeMK":"FI2291","CPMK":"Dampak energi terhadap lingkungan: perubahan iklim global, Sampah nuklir, Polusi kalor.","KodeCPL":"CPL 01"},{"KodeMK":"FI2291","CPMK":"Energi dan konsep termodinamika. Energi dan Exergi.","KodeCPL":"CPL 02"},{"KodeMK":"FI2291","CPMK":"Energi, ekologi, lingkungan.","KodeCPL":"CPL 02"},{"KodeMK":"FI3091","CPMK":"Memiliki kemampuan dasar dalam berkomunikasi, baik secara lisan, tulisan, maupun visual.","KodeCPL":"CPL 06"},{"KodeMK":"FI3091","CPMK":"Dapat bekerja secara efektif baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI3091","CPMK":"Mampu menerapkan pengetahuan mereka dalam masalah nyata.","KodeCPL":"CPL 08"},{"KodeMK":"FI3091","CPMK":"Memiliki pemahaman tentang pentingnya menjaga komitmen, kerja sama tim, dan disiplin di tempat kerja.","KodeCPL":"CPL 09"},{"KodeMK":"FI3092","CPMK":"Dapat menjelaskan dan mengkomunikasikan topik yang dipilih baik secara lisan maupun secara tulisan.","KodeCPL":"CPL 06"},{"KodeMK":"FI3092","CPMK":"Menunjukan kemampuan mengenai topik yang dipilih dan dapat dapat menjelaskannya berdasarkan referensi secara mandiri.","KodeCPL":"CPL 07"},{"KodeMK":"FI3092","CPMK":"Dapat membuat rencana dan merangkai tahapan-tahapan dalam mempelajari topik yang dipilih secara efektif.","KodeCPL":"CPL 07"},{"KodeMK":"FI3092","CPMK":"Dapat membangun kreatifitas dan berpikir kritis, inovatif, serta menunjukkan kejujuran dan rasa tanggung jawab.","KodeCPL":"CPL 09"},{"KodeMK":"FI3092","CPMK":"Dalam memilih referensi yang sesuai untuk mendukung pembelajaran terhadap topik yang dipilih.","KodeCPL":"CPL 10"},{"KodeMK":"FI3092","CPMK":"Dapat merangkum sumber-sumber ilmiah yang terkait dengan topik yang dipilih.","KodeCPL":"CPL 10"},{"KodeMK":"FI3093","CPMK":"Memiliki kemampuan dasar dalam berkomunikasi, baik secara lisan, tulisan, maupun visual.","KodeCPL":"CPL 06"},{"KodeMK":"FI3093","CPMK":"Dapat bekerja secara efektif baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI3093","CPMK":"Dapat mengaplikasikan pengetahuannya dalam bidang fisika ke bidang yang lebih luas/ permasalahan interdisiplin.","KodeCPL":"CPL 08"},{"KodeMK":"FI3093","CPMK":"Dapat melaksanakan proyek dengan baik dan melakukan manajemen proyek secara efektif dan efisien.","KodeCPL":"CPL 09"},{"KodeMK":"FI3094","CPMK":"Memiliki kemampuan dasar dalam berkomunikasi, baik secara lisan, tulisan, maupun visual.","KodeCPL":"CPL 06"},{"KodeMK":"FI3094","CPMK":"Dapat bekerja secara efektif baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI3094","CPMK":"Dapat mengaplikasikan pengetahuannya dalam bidang fisika ke bidang yang lebih luas/ permasalahan interdisiplin.","KodeCPL":"CPL 08"},{"KodeMK":"FI3094","CPMK":"Dapat melaksanakan proyek dengan baik dan melakukan manajemen proyek secara efektif dan efisien.","KodeCPL":"CPL 09"},{"KodeMK":"FI3095","CPMK":"Memiliki kemampuan dasar dalam berkomunikasi, baik secara lisan, tulisan, maupun visual.","KodeCPL":"CPL 06"},{"KodeMK":"FI3095","CPMK":"Dapat bekerja secara efektif baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI3095","CPMK":"Dapat mengaplikasikan pengetahuannya dalam bidang fisika ke bidang yang lebih luas/ permasalahan interdisiplin.","KodeCPL":"CPL 08"},{"KodeMK":"FI3095","CPMK":"Dapat melaksanakan proyek dengan baik dan melakukan manajemen proyek secara efektif dan efisien.","KodeCPL":"CPL 09"},{"KodeMK":"FI3096","CPMK":"Memiliki kemampuan dasar dalam berkomunikasi, baik secara lisan, tulisan, maupun visual.","KodeCPL":"CPL 06"},{"KodeMK":"FI3096","CPMK":"Dapat bekerja secara efektif baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI3096","CPMK":"Dapat mengaplikasikan pengetahuannya dalam bidang fisika ke bidang yang lebih luas/ permasalahan interdisiplin.","KodeCPL":"CPL 08"},{"KodeMK":"FI3096","CPMK":"Dapat melaksanakan proyek dengan baik dan melakukan manajemen proyek secara efektif dan efisien.","KodeCPL":"CPL 09"},{"KodeMK":"FI3097","CPMK":"Memiliki kemampuan dasar dalam berkomunikasi, baik secara lisan, tulisan, maupun visual.","KodeCPL":"CPL 06"},{"KodeMK":"FI3097","CPMK":"Dapat bekerja secara efektif baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI3097","CPMK":"Dapat mengaplikasikan pengetahuannya dalam bidang fisika ke bidang yang lebih luas/ permasalahan interdisiplin.","KodeCPL":"CPL 08"},{"KodeMK":"FI3097","CPMK":"Dapat melaksanakan proyek dengan baik dan melakukan manajemen proyek secara efektif dan efisien.","KodeCPL":"CPL 09"},{"KodeMK":"FI3101","CPMK":"Mampu memahami sudut pandang Lagrangian maupun Eulerian untuk memperoleh deskripsi gerak objek kontinu sebagai fungsi ruang dan waktu","KodeCPL":"CPL 01"},{"KodeMK":"FI3101","CPMK":"Mampu memahami dinamika objek kontinu","KodeCPL":"CPL 02"},{"KodeMK":"FI3101","CPMK":"Mampu memahami dan menganalisis deformasi benda padat dalam batasan deformasi elastis","KodeCPL":"CPL 03"},{"KodeMK":"FI3101","CPMK":"Mampu memahami dan menganalisis mekanika fluida melalui konservasi massa, momentum, dan energi.","KodeCPL":"CPL 04"},{"KodeMK":"FI3101","CPMK":"Mampu memahami dan menganalisis stress dan failure pada benda","KodeCPL":"CPL 05"},{"KodeMK":"FI3101","CPMK":"Mampu melaksanakan eksperimen dalam bidang fisika atau bidang lain terkait fisika, serta dapat mengolah, menganalisis, dan menginterpretasi data yang diperoleh","KodeCPL":"CPL 05"},{"KodeMK":"FI3101","CPMK":"Mampu memahami dan menganalisis relasi antara stress distribution, strain distribution dan failure yang kemungkinan terjadi secara komprehensif dari seluruh parameter elastik","KodeCPL":"CPL 05"},{"KodeMK":"FI3102","CPMK":"Mampu identifikasi besaran-besaran fisika yang berkaitan dengan gelombang dalam berbagai medium elastik atau gelombang EM.","KodeCPL":"CPL 01"},{"KodeMK":"FI3102","CPMK":"Mampu menerapkan persamaan gelombang dan hukum-hukum Fisika yang relevan untuk berbagai model fisis dengan menggunakan matematika.","KodeCPL":"CPL 02"},{"KodeMK":"FI3102","CPMK":"Mampu memecahkan persamaan gelombang dan hukum-hukum Fisika relevan untuk berbagai model fisis dengan menerapkan matematika dan komputasi yang diperlukan.","KodeCPL":"CPL 03"},{"KodeMK":"FI3102","CPMK":"Mampu menganalisis berbagai gejala gelombang dan interaksinya dengan materi serta keterkaitannya dalam sebuah sistem fisis dan metoda komputasi yang diperlukan.","KodeCPL":"CPL 04"},{"KodeMK":"FI3102","CPMK":"Dapat menerapkan prinsip-prinsip gelombang dalam berbagai aplikasi teknologi","KodeCPL":"CPL 08"},{"KodeMK":"FI3103","CPMK":"Mampu membuat code dalam matlab sebagai tools interface antara algoritma dan computer.","KodeCPL":"CPL 02"},{"KodeMK":"FI3103","CPMK":"Dapat mengubah system kontinu menjadi bentuk diskrit.","KodeCPL":"CPL 03"},{"KodeMK":"FI3103","CPMK":"Mampu melakukan analisis persoalan fisis melalui penyederhanaan.","KodeCPL":"CPL 03"},{"KodeMK":"FI3103","CPMK":"Mampu membuat model fisis dari persoalan yang harus diselesaikan.","KodeCPL":"CPL 03"},{"KodeMK":"FI3103","CPMK":"Memiliki pengetahuan dan wawasan bahwa sistem fisis tidak perlu untuk disederhanakan terlalu banyak sehingga membuang aspek fisis yang sesungguhnya.","KodeCPL":"CPL 10"},{"KodeMK":"FI3104","CPMK":"Mampu merancang dan mempersiapkan eksperimen pada topik Fisika Modern","KodeCPL":"CPL 05"},{"KodeMK":"FI3104","CPMK":"Mampu melakukan beberapa eksperimen fisika dan pengambilan data secara benar dalam waktu yang telah ditentukan, dengan mengacu pada standar-standar keselamatan.","KodeCPL":"CPL 05"},{"KodeMK":"FI3104","CPMK":"Mampu menganalisis dan menginterpretasi data eksperimen, dan mampu menilai apakah data yang didapat sudah benar atau belum.","KodeCPL":"CPL 06"},{"KodeMK":"FI3104","CPMK":"Mampu menampilkan data eksperimen dengan baik, melakukan analisis data, dan memaparkan hasil dengan jelas, baik dalam laporan tertulis maupun presentasi.","KodeCPL":"CPL 07"},{"KodeMK":"FI3104","CPMK":"Mampu melakukan aktifitas riset sederhana secara berkelompok, termasuk di dalamnya merencanakan dan menyiapkan riset tersebut secara rinci.","KodeCPL":"CPL 07"},{"KodeMK":"FI3111","CPMK":"Mahasiswa mampu memahami prinsip ekivalensi dan melakukan analisis terhadap implikasi prinsip ekivalensi","KodeCPL":"CPL 01"},{"KodeMK":"FI3111","CPMK":"Mahasiswa mampu memahami dan melakukan analisis menggunakan kalkulus tensor","KodeCPL":"CPL 02"},{"KodeMK":"FI3111","CPMK":"Mahasiswa mampu memahami dan melakukan analisis dinamika menggunakan persamaan geodesik.","KodeCPL":"CPL 02"},{"KodeMK":"FI3111","CPMK":"Mahasiswa mampu memahami dan melakukan analisis dinamika menggunakan persamaan medan Einstein vakum khususnya solusi statik","KodeCPL":"CPL 03"},{"KodeMK":"FI3111","CPMK":"Mahasiswa mampu memahami persamaan medan Einstein dengan materi","KodeCPL":"CPL 04"},{"KodeMK":"FI3121","CPMK":"Mampu menjelaskan sifat-sifat bahan semikonduktor dan nanomaterial yang bermanfaat untuk konversi energi cahaya menjadi energi lainnya.","KodeCPL":"CPL 01"},{"KodeMK":"FI3121","CPMK":"Mampu menjelaskan proses konversi energi pada bahan elektro/fotoaktif.","KodeCPL":"CPL 01"},{"KodeMK":"FI3121","CPMK":"Mampu menjelaskan sifat-sifat bahan magnetik dan bahan pengubah fasa yang bermanfaat untuk konversi energi dan penyimpanan energi.","KodeCPL":"CPL 01"},{"KodeMK":"FI3121","CPMK":"Mampu membuat laporan / makalah terkait dengan sifat-sifat bahan dan proses fisika-kimia terkait untuk konversi dan penyimpanan energi terbarukan.","KodeCPL":"CPL 06"},{"KodeMK":"FI3121","CPMK":"Mampu memahami fenomena fisika dalam proses konversi energi yang juga melibatkan prinsip-prinsip kimia dan bio-kimia.","KodeCPL":"CPL 08"},{"KodeMK":"FI3131","CPMK":"Mampu menjelaskan struktur, proses dan sifat-sifat utama dari beberapa jenis matrial.","KodeCPL":"CPL 01"},{"KodeMK":"FI3131","CPMK":"Mampu menjelaskan karakterisasi material maju","KodeCPL":"CPL 01"},{"KodeMK":"FI3131","CPMK":"Mampu menjelaskan hubungan antara proses pembuatan-struktur-sifat material","KodeCPL":"CPL 01"},{"KodeMK":"FI3131","CPMK":"Mampu menilai dan memilih material untuk kebutuhan tertentu menggunakan analisis kuantitatif.","KodeCPL":"CPL 01"},{"KodeMK":"FI3132","CPMK":"Memahami peran strategis material maju dalam berbagai industri.","KodeCPL":"CPL 08"},{"KodeMK":"FI3132","CPMK":"Memahami pentingnya material maju dalam industri teknologi modern.","KodeCPL":"CPL 08"},{"KodeMK":"FI3132","CPMK":"Memahami sifat-sifat material seperti silikon kristalin, perovskit, material organik dalam sel surya, serta material baterai seperti lithium-ion dan solid-state.","KodeCPL":"CPL 08"},{"KodeMK":"FI3132","CPMK":"Memahami aplikasi material maju dalam bidang biomedis.","KodeCPL":"CPL 08"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu mengklasifikasikan dan menganalisa tentang karakteristik dan sumber radiasi nuklir.","KodeCPL":"CPL 01"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu mengklasifikasikan dan menganalisa tentang karakteristik dan sumber radiasi nuklir.","KodeCPL":"CPL 01"},{"KodeMK":"FI3141","CPMK":"Mampu mengklasifikasi jenis-jenis aplikasi nuklir dalam riset dan industri Mampu menjelaskan prinsip kerja baterei nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI3141","CPMK":"Mampu menjelaskan aplikasi nuklir secara spesifik dalam industri perminyakan dan gas.","KodeCPL":"CPL 01"},{"KodeMK":"FI3141","CPMK":"Mampu menjelaskan aplikasi nuklir dalam bidang Kesehatan.","KodeCPL":"CPL 01"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu menjalankan RBL tentang aplikasi instrumentasi nuklir di bidang industri dan medis sesuai kerangka waktu yang diberikan","KodeCPL":"CPL 05"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu menganalisa tentang berbagai jenis detector nuklir","KodeCPL":"CPL 08"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu mendemonstrasikan dan menganalisa tentang rangkaian pre amplifier dan amplifier, serta prinsip kerjanya","KodeCPL":"CPL 08"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu menjelaskan aplikasi instrumentasi nuklir dalam berbagai bidang termasuk kedokteran dan industri.","KodeCPL":"CPL 08"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu menganalisa tentang diskriminator, timing circuit, scaller, dan paratemeter","KodeCPL":"CPL 08"},{"KodeMK":"FI3141","CPMK":"Mahasiswa mampu menganalisa tentang prinsip kerja, rangkaian, dan karakteristik SCA dan MCA.","KodeCPL":"CPL 08"},{"KodeMK":"FI3151","CPMK":"Menguasai konsep-konsep dan prinsip-prinsip dasar dan lanjut radiasi pengion pada bidang radiologi dan dosimetry radiasi.","KodeCPL":"CPL 01"},{"KodeMK":"FI3151","CPMK":"Menerapkan pemahaman tentang konsep dan prinsip radiasi pengion untuk meningkatkan ketelitian dan keakurasian dari dosimetri radiasi pada bidang medis.","KodeCPL":"CPL 02"},{"KodeMK":"FI3151","CPMK":"Menggunakan pemahaman tentang konsep dan prinsip radiasi pengion untuk pengembangan pemodelan dari dosimetry radiasi pada bidang medis.","KodeCPL":"CPL 04"},{"KodeMK":"FI3151","CPMK":"Mengembangkan diri secara berkelanjutan dalam mengikuti perkembangan ilmu dan teknologi pada bidang radiologi dan dosimetry radiasi.","KodeCPL":"CPL 08"},{"KodeMK":"FI3152","CPMK":"Mampu mengikuti perkembangan terakhir (state of the art) dalam bidang elektrofisiologi dan bioenergetika.","KodeCPL":"CPL 01"},{"KodeMK":"FI3152","CPMK":"Mampu mengaplikasikan bidang elektrofisiologi dan bioenergetika untuk memahami berbagai mekanisme yang terjadi pada sistem biologi","KodeCPL":"CPL 03"},{"KodeMK":"FI3152","CPMK":"Dapat memperluas wawasan ilmu dan metodologi fisika dalam bidang Elektrofisiologi dan Bioenergetika","KodeCPL":"CPL 08"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu memahami proses dinamika Bumi dan pembentukan batuan","KodeCPL":"CPL 01"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu memahami proses dinamika Bumi dan pembentukan batuan","KodeCPL":"CPL 01"},{"KodeMK":"FI3161","CPMK":"Mahasiswa memahami struktur dan besaran mikrogeometri batuan","KodeCPL":"CPL 02"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu memahami sifat elastik batuan, sifat kelistrikan dan aliran fluida dalam batuan.","KodeCPL":"CPL 02"},{"KodeMK":"FI3161","CPMK":"Mahasiswa memahami struktur dan besaran mikrogeometri batuan","KodeCPL":"CPL 02"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu memahami sifat elastik batuan, sifat kelistrikan dan aliran fluida dalam batuan.","KodeCPL":"CPL 02"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu menerapkan pemahaman tentang sifat elastik batuan, sifat kelistrikan dan aliran fluida dalam batuan untuk keperluan bidang terkait.","KodeCPL":"CPL 03"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu menganalisa komposisi mineral batuan berdasarkan hasil karakterisasi yang dilakukan.","KodeCPL":"CPL 04"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu menerapkan pemahaman tentang sifat elastik batuan, sifat kelistrikan dan aliran fluida dalam batuan untuk keperluan bidang terkait.","KodeCPL":"CPL 04"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu menghitung besaran fisis secara komputasi sederhana","KodeCPL":"CPL 05"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu menganalisa komposisi mineral batuan berdasarkan hasil karakterisasi yang dilakukan.","KodeCPL":"CPL 05"},{"KodeMK":"FI3161","CPMK":"Mahasiswa mampu menghitung besaran fisis secara komputasi sederhana","KodeCPL":"CPL 06"},{"KodeMK":"FI3162","CPMK":"Mampu memahami sistem panasbumi sebagai konsep Fisika dan mampu menerapkannya dalam eksplorasi dan eksploitasi reservoir panasbumi.","KodeCPL":"CPL 02"},{"KodeMK":"FI3163","CPMK":"Mampu mendeskripsikan struktur Bumi dan mampu menjelaskan proses dinamika dalam Bumi.","KodeCPL":"CPL 02"},{"KodeMK":"FI3163","CPMK":"Mengenali dan memahami berbagai jenis material bumi (batuan), proses pembentukan serta siklusnya.","KodeCPL":"CPL 02"},{"KodeMK":"FI3163","CPMK":"Memahami berbagai besaran fisis material bumi dan mampu mengaplikasikan berbagai metode fisika untuk mengukur besaran-besaran tersebut.","KodeCPL":"CPL 02"},{"KodeMK":"FI3163","CPMK":"Memahami prinsip dasar Geosains untuk Fisika Bumi serta karakteristiknya yang meliputi interaksi antar variabel, munculnya perilaku kolektif, dan kemampuan pengaturan diri.","KodeCPL":"CPL 02"},{"KodeMK":"FI3171","CPMK":"Mampu menjelaskan konsep dasar dan fungsi mikrokontroller","KodeCPL":"CPL 01"},{"KodeMK":"FI3171","CPMK":"Mampu merancang sistem fisis berbasis mikrokontroller dan sistem terintegrasi","KodeCPL":"CPL 01"},{"KodeMK":"FI3171","CPMK":"Mampu merancang, merekayasa, dan menganalisis sistem berbasis mikrokontroller dan sistem terintegrasi sesuai kebutuhan.","KodeCPL":"CPL 05"},{"KodeMK":"FI3171","CPMK":"Mampu menganalisis dan mengambil keputusan dalam menyelesaikan masalah terkait sistem berbasis mikrokontroller dan sistem terintegrasi.","KodeCPL":"CPL 05"},{"KodeMK":"FI3171","CPMK":"Mampu melaporkan hasil karya nya dalam bentuk lisan ataupun tulisan","KodeCPL":"CPL 06"},{"KodeMK":"FI3171","CPMK":"Mampu bekerja secara efektif, baik secara individu maupun dalam grup","KodeCPL":"CPL 07"},{"KodeMK":"FI3172","CPMK":"Mampu memformulasikan metoda numerik yang ada untuk besaran-besaran fisika serta model fisis menggunakan matematika.","KodeCPL":"CPL 03"},{"KodeMK":"FI3172","CPMK":"Mampu menerapkan konsep/prinsip/hukum FIsika terkait dengan system fisis serta mencari solusi dari model fisis tersebut secara komputasi","KodeCPL":"CPL 03"},{"KodeMK":"FI3172","CPMK":"Mampu melakukan analisis secara numerik untuk problem fisis yang ada","KodeCPL":"CPL 04"},{"KodeMK":"FI3172","CPMK":"Mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan masalah-masalah sistem fisis.","KodeCPL":"CPL 04"},{"KodeMK":"FI3172","CPMK":"Mampu melaporkan hasil karya nya dalam bentuk lisan ataupun tulisan","KodeCPL":"CPL 06"},{"KodeMK":"FI3191","CPMK":"Memahami Konsep dan prinsip sumber sumber Energi yang digunakan","KodeCPL":"CPL 01"},{"KodeMK":"FI3191","CPMK":"Mampu berpikir secara sistemis dan memiliki pola pikir yang logis untuk memahami fenomena energi","KodeCPL":"CPL 01"},{"KodeMK":"FI3201","CPMK":"Mampu menunjukkan pengetahuan dalam masalah fisika klasik yang menjadi dasar dari quantum theory dan early quantum theory","KodeCPL":"CPL 01"},{"KodeMK":"FI3201","CPMK":"Mampu menunjukkan konsep dasar quantum physics","KodeCPL":"CPL 01"},{"KodeMK":"FI3201","CPMK":"Mampu untuk memformulasikan dalam formalisme operator","KodeCPL":"CPL 02"},{"KodeMK":"FI3201","CPMK":"Mampu menunjukkan kemampuan untuk menyelesaikan dan menganalisa masalah quantum physics sederhana seperti barrier potential, partikel di dalam kotak, osilator harmonik dalam 1 dimensi","KodeCPL":"CPL 03"},{"KodeMK":"FI3201","CPMK":"Mampu mengidentifikasi, memformulasi dan menyelesaikan masalah kuantum dalam 3 dimensi","KodeCPL":"CPL 03"},{"KodeMK":"FI3201","CPMK":"Mampu menunjukkan dan mengaplikasikan teori pertubasi tidak bergantung waktu","KodeCPL":"CPL 10"},{"KodeMK":"FI3202","CPMK":"Mampu memahami dasar-dasar fisika statistic.","KodeCPL":"CPL 01"},{"KodeMK":"FI3202","CPMK":"Mampu memformulasikan masalah sederhana pada bidang fisika dan bidang-bidang lain yang menggunakan fisika statistik.","KodeCPL":"CPL 02"},{"KodeMK":"FI3202","CPMK":"Mampu menerapkannya dalam masalah sederhana pada bidang fisika dan bidang-bidang lain yang menggunakan fisika statistic.","KodeCPL":"CPL 03"},{"KodeMK":"FI3202","CPMK":"Mampu memahami kuliah lanjut tentang sifat-sifat zat maupun kuliah lain yang menggunakan fisika statistic.","KodeCPL":"CPL 10"},{"KodeMK":"FI3203","CPMK":"Memahami teknik dasar pemodelan dan simulasi sistem fisis","KodeCPL":"CPL 01"},{"KodeMK":"FI3203","CPMK":"Mengenal pemodelan fisika berbasis bilangan random dan sistem partikel","KodeCPL":"CPL 01"},{"KodeMK":"FI3203","CPMK":"Mengenal dan mampu menerapkan berbagai metode intelegensia buatan dalam berbagai sistem fisis","KodeCPL":"CPL 03"},{"KodeMK":"FI3203","CPMK":"Mampu mengaplikasikan transformasi Fourier untuk pengolahan sinyal dan sistem random","KodeCPL":"CPL 04"},{"KodeMK":"FI3203","CPMK":"Mengembangkan desain pemrograman sistem fisika berbasis sistem grid","KodeCPL":"CPL 04"},{"KodeMK":"FI3203","CPMK":"Mampu menganalisis data hasil simulasi yang diperoleh, terutama dengan perangkat grafik","KodeCPL":"CPL 04"},{"KodeMK":"FI3203","CPMK":"Mampu menggunakan dan/atau mengembangkan metode dan perangkat bantu komputasi (dapat berupa kode program) yang sesuai sebagai alat dalam memecahkan berbagai permasalahan fisis","KodeCPL":"CPL 10"},{"KodeMK":"FI3204","CPMK":"Mampu merancang dan menyiapkan eksperimen fisika nuklir, material elektronik, kebumian, fotonik, dan karakterisasi lanjut.","KodeCPL":"CPL 05"},{"KodeMK":"FI3204","CPMK":"Mampu melakukan beberapa eksperimen fisika dan pengambilan data secara benar dalam waktu yang telah ditentukan, dengan mengacu pada standar-standar keselamatan.","KodeCPL":"CPL 05"},{"KodeMK":"FI3204","CPMK":"Mampu menganalisis dan menginterpretasi data eksperimen, dan mampu menilai apakah data yang didapat sudah benar atau belum.","KodeCPL":"CPL 06"},{"KodeMK":"FI3204","CPMK":"Mampu menampilkan data eksperimen dengan baik, melakukan analisis data, dan memaparkan hasil dengan jelas, baik dalam laporan tertulis maupun presentasi.","KodeCPL":"CPL 07"},{"KodeMK":"FI3204","CPMK":"Mampu melakukan aktifitas serupa riset secara berkelompok.","KodeCPL":"CPL 07"},{"KodeMK":"FI3205","CPMK":"Mahasiswa menguasai teknik menulis karya ilmiah dan dapat melakukan presentasi oral maupun poster secara efektif","KodeCPL":"CPL 06"},{"KodeMK":"FI3206","CPMK":"memahami fenomena fisis yang dialami oleh sistem biologi.","KodeCPL":"CPL 01"},{"KodeMK":"FI3206","CPMK":"memahami karakteristik dan pengolalahan informasi pada sistem biologi.","KodeCPL":"CPL 01"},{"KodeMK":"FI3206","CPMK":"memahami hubungan antara besaran makroskopis sistem hidup dengan besaran mikrokospis dari interaksi antara penyusunnya.","KodeCPL":"CPL 01"},{"KodeMK":"FI3206","CPMK":"memahami hubungan antara sistem hidup dan lingkungannya.","KodeCPL":"CPL 01"},{"KodeMK":"FI3206","CPMK":"menyelesaikan permasalahan fisis yang dialami oleh sistem biologi.","KodeCPL":"CPL 04"},{"KodeMK":"FI3211","CPMK":"Mampu memahami konsep-konsep sederhana dan metode dalam teori grup.","KodeCPL":"CPL 01"},{"KodeMK":"FI3211","CPMK":"Mampu memahami konsep-konsep sederhana dan metode dalam teori grup beserta aplikasinya.","KodeCPL":"CPL 02"},{"KodeMK":"FI3211","CPMK":"Mengetahui aplikasinya terutama pada teori relativitas khusus dan teori medan klasik khususnya solusi monopol dan soliton.","KodeCPL":"CPL 03"},{"KodeMK":"FI3211","CPMK":"Mampu memahami dan memperluas konsep-konsep sederhana dan metode dalam teori grup mengetahui aplikasinya terutama untuk memodifikasi teori relativitas khusus dan teori medan klasik.","KodeCPL":"CPL 04"},{"KodeMK":"FI3221","CPMK":"Mampu identifikasi besaran-besaran fisika yang berkaitan dengan gelombang elektromagnetik dalam berbagai model fisis.","KodeCPL":"CPL 01"},{"KodeMK":"FI3221","CPMK":"Mampu menerapkan persamaan gelombang dan hukum-hukum Fisika relevan untuk berbagai model fisis dengan menggunakan matematika.","KodeCPL":"CPL 02"},{"KodeMK":"FI3221","CPMK":"Mampu memecahkan persamaan gelombang dan hukum-hukum Fisika relevan untuk berbagai model fisis dengan menerapkan matematika dan komputasi yang diperlukan.","KodeCPL":"CPL 03"},{"KodeMK":"FI3221","CPMK":"Mampu menganalisis berbagai gejala gelombang dan interaksinya dengan materi serta keterkaitannya dalam sebuah sistem fisis dan metoda komputasi yang diperlukan.","KodeCPL":"CPL 04"},{"KodeMK":"FI3221","CPMK":"Mampu menunjukkan aplikasi berbagai fenomena gelombang dan interaksinya dengan materi","KodeCPL":"CPL 08"},{"KodeMK":"FI3222","CPMK":"Memahami teknik pengukuran morfologi, sifat fisis, optik, kimiawi serta karakteristik elemental dari material secara umum.","KodeCPL":"CPL 01"},{"KodeMK":"FI3222","CPMK":"Memahami prinsip mikroskopi/imaging dengan SEM,TEM dan AFM dari material.","KodeCPL":"CPL 01"},{"KodeMK":"FI3222","CPMK":"Memahami prinnsip hamburan dan difraksi dari material dengan X-Ray dan Neutron.","KodeCPL":"CPL 01"},{"KodeMK":"FI3222","CPMK":"Memahami prinsip spektroskopi optik dengan UV-Vis dan SPR untuk material dalam bentuk larutan ataupun film tipis.","KodeCPL":"CPL 01"},{"KodeMK":"FI3222","CPMK":"Memahami prinsip spektroskopi vibrasi dari struktur molekul yang menyusun material dengan menggunakan sumber Infrared dan Raman.","KodeCPL":"CPL 01"},{"KodeMK":"FI3222","CPMK":"Memahami prinsip spektroskopi elemental XPS dan XAS.","KodeCPL":"CPL 01"},{"KodeMK":"FI3222","CPMK":"Memahami dan dapat melakukan persiapan material serta melakukan pengukuran secara mandiri terhadap alat ukur yang telah dipelajari.","KodeCPL":"CPL 05"},{"KodeMK":"FI3222","CPMK":"Dapat memanfaatkan secara benar dan tepat dalam teknik karakterisasi material untuk aplikasi dibidang divais optoelektronik ataupun magnetik.","KodeCPL":"CPL 08"},{"KodeMK":"FI3231","CPMK":"Memahami konsep dan prinsip dasar material maju yang digunakan dalam aplikasi energi.","KodeCPL":"CPL 08"},{"KodeMK":"FI3231","CPMK":"Mampu menjelaskan sistem kerja energi terbarukan.","KodeCPL":"CPL 08"},{"KodeMK":"FI3231","CPMK":"Memahami berbagai material dan perangkat yang digunakan untuk aplikasi penyimpanan energi.","KodeCPL":"CPL 09"},{"KodeMK":"FI3231","CPMK":"Memahami material maju yang dirancang untuk proses pemanfaatan dan konversi energi, seperti: termoelektrik, material piezoelektrik, dan teknologi konversi energi lainnya.","KodeCPL":"CPL 10"},{"KodeMK":"FI3232","CPMK":"Memahami berbagai metode sintesis nanomaterial yang digunakan dalam pembuatan material nano.","KodeCPL":"CPL 08"},{"KodeMK":"FI3232","CPMK":"Memahami teknik-teknik karakterisasi elektronik nanomaterial.","KodeCPL":"CPL 08"},{"KodeMK":"FI3232","CPMK":"Memahami teknik karakterisasi sifat mekanik nanomaterial.","KodeCPL":"CPL 08"},{"KodeMK":"FI3241","CPMK":"Mahasiswa mampu memahami berbagai jenis reaksi nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI3241","CPMK":"Mahasiswa mampu menjelaskan prinsip kerja berbagai jenis PLTN dan karakteristik dasarnya","KodeCPL":"CPL 01"},{"KodeMK":"FI3241","CPMK":"Mahasiswa mampu menyelesaikan persamaan transport neutron pada reaktor nuklir","KodeCPL":"CPL 03"},{"KodeMK":"FI3241","CPMK":"Mahasiswa mampu menganalisis kekritisan PLTN serta distribusi dayanya dengan teori difusi","KodeCPL":"CPL 04"},{"KodeMK":"FI3241","CPMK":"Mahasiswa mampu menganalisis perubahan komposisi teras saat reactor nuklir dioperasikan","KodeCPL":"CPL 04"},{"KodeMK":"FI3241","CPMK":"Mahasiswa mampu menganalisis aspek termohidrolika PLTN dengan model satu kanal","KodeCPL":"CPL 04"},{"KodeMK":"FI3241","CPMK":"Mahasiswa mampu menganalisis keselamatan PLTN dengan model sederhana","KodeCPL":"CPL 04"},{"KodeMK":"FI3242","CPMK":"Mengenal tentang siklus bahan bakar nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI3242","CPMK":"Memahami proses pengelolaan bahan bakar sebelum dimasukkan dalam reaktor","KodeCPL":"CPL 01"},{"KodeMK":"FI3242","CPMK":"Memahami proses pengelolaan bahan bakar selama dalam reaktor","KodeCPL":"CPL 01"},{"KodeMK":"FI3242","CPMK":"Memahami proses pengelolaan bahan bakar setelah dikeluarkan dari reaktor","KodeCPL":"CPL 01"},{"KodeMK":"FI3242","CPMK":"Memahami proses pengelolaan limbah nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI3242","CPMK":"Memahami proses penutupan sebuah reaktor nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI3251","CPMK":"menguasai konsep-konsep dan prinsip-prinsip dasar dan lanjut radiasi pengion pada bidang diagnostik medis.","KodeCPL":"CPL 01"},{"KodeMK":"FI3251","CPMK":"menerapkan pemahaman tentang konsep dan prinsip radiasi pengion untuk meningkatkan kualitas diagnostik radiasi di bidang medis.","KodeCPL":"CPL 02"},{"KodeMK":"FI3251","CPMK":"menggunakan pemahaman tentang konsep dan prinsip radiasi pengion untuk pengembangan diagnostik radiasi medis.","KodeCPL":"CPL 04"},{"KodeMK":"FI3251","CPMK":"mengembangkan diri secara berkelanjutan dalam mengikuti perkembangan ilmu dan teknologi pada bidang diagnostik radiasi medis.","KodeCPL":"CPL 08"},{"KodeMK":"FI3252","CPMK":"merencanakan dan menyiapkan eksperimen atau prosedur analisa pada topik pengukuran dan analisa radiasi pengion.","KodeCPL":"CPL 05"},{"KodeMK":"FI3252","CPMK":"melakukan eksperimen fisika dan pengambilan data secara benar dalam waktu yang telah ditentukan, dengan mengacu pada standar-standar keselamatan untuk topik radiasi pengion","KodeCPL":"CPL 05"},{"KodeMK":"FI3252","CPMK":"menganalisis dan menginterpretasi data eksperimen, dan mampu menilai apakah data yang didapat sudah benar atau belum.","KodeCPL":"CPL 05"},{"KodeMK":"FI3252","CPMK":"menampilkan data eksperimen dengan baik, melakukan analisis data, dan memaparkan hasil dengan jelas, baik dalam laporan tertulis maupun presentasi.","KodeCPL":"CPL 06"},{"KodeMK":"FI3252","CPMK":"melakukan aktifitas riset sederhana secara berkelompok, termasuk di dalamnya merencanakan dan menyiapkan riset tersebut secara rinci.","KodeCPL":"CPL 07"},{"KodeMK":"FI3261","CPMK":"Mampu memahami hukum-hukum fisika di sistem sosial dan ekonomi","KodeCPL":"CPL 01"},{"KodeMK":"FI3261","CPMK":"Mampu menggunakan persamaan dinamika pada proses stokastik dan memformulasikan dan mensimulasikannya pada system sosio-ekonomi","KodeCPL":"CPL 01"},{"KodeMK":"FI3261","CPMK":"Mampu menerapkan hukum-hukum fisika pada suatu kasus di sistem ekonomi dan sosial","KodeCPL":"CPL 02"},{"KodeMK":"FI3261","CPMK":"Mampu menganalisis menganalisis hukum-hukum fisika pada sistem sosio-ekonomi dan mengaplikasikan pada kasus seperti polarisasi opini dan segregasi","KodeCPL":"CPL 03"},{"KodeMK":"FI3261","CPMK":"Memahami dan memanfaatkan ICT untuk menyelesaikan dan menganalisis permasalahan dalam bidang sosio-ekonomi","KodeCPL":"CPL 04"},{"KodeMK":"FI3262","CPMK":"Tinjauan ulang teori medan elektromagnetik (EM): persamaan Maxwell, persamaan gelombang dan difusi elektromagnetik, efek kulit, transmisi dan refleksi medan EM.","KodeCPL":"CPL 02"},{"KodeMK":"FI3262","CPMK":"Sumber medan EM : sumber alamiah, dipole listrik, dipole magnetik. Fungsi respon bumi : tensor impedansi, tipper, resistivitas semu dan fasa impedansi.","KodeCPL":"CPL 02"},{"KodeMK":"FI3262","CPMK":"Metoda-metoda EM: metoda magnetotellurik (MT), CSAMT, transien EM (TEM), Very Low Frequency (VLF), metoda Ground Penetrating Radar (GPR)","KodeCPL":"CPL 05"},{"KodeMK":"FI3262","CPMK":"Teknik-teknik pengukuran, pemrosesan dan analisa data, interpretasi data EM, aplikasi metoda EM untuk eksplorasi dan studi kebumian.","KodeCPL":"CPL 05"},{"KodeMK":"FI3263","CPMK":"Menguasai metode analisis penggunaan kecerdasan buatan","KodeCPL":"CPL 04"},{"KodeMK":"FI3263","CPMK":"Mampu memilih metode kecerdasan buatan yang sesuai untuk menyelesaikan permasalahan sistem fisis bumi","KodeCPL":"CPL 04"},{"KodeMK":"FI3263","CPMK":"Mampu mendesain dan mengimplementasikan metode kecerdasan buatan dan digunakan untuk penyelesaian masalah di sistem fisis bumi","KodeCPL":"CPL 04"},{"KodeMK":"FI3263","CPMK":"Mampu mengimplementasikan metode deep learning untuk penyelesaian masalah di sistem fisis bumi","KodeCPL":"CPL 04"},{"KodeMK":"FI3264","CPMK":"Mampu menggunakan teknik pencitraan reservoir, seismik dan resistivitas dalam berbagai kasus.","KodeCPL":"CPL 08"},{"KodeMK":"FI3271","CPMK":"Mampu menjelaskan konsep dasar berpikir komputasi","KodeCPL":"CPL 01"},{"KodeMK":"FI3271","CPMK":"Merancang algoritma untuk pemecahan problem sistem fisis dan pengolahan datanya","KodeCPL":"CPL 04"},{"KodeMK":"FI3271","CPMK":"Mengimplementasikan metoda mesin pembelajaran untuk analisa data problem fisis","KodeCPL":"CPL 06"},{"KodeMK":"FI3271","CPMK":"Mampu melaporkan hasil karya ilmiah dalam bentuk lisan maupun tulisan","KodeCPL":"CPL 07"},{"KodeMK":"FI3271","CPMK":"Mampu bekerja secara efektif, baik secara individu maupun dalam grup","KodeCPL":"CPL 07"},{"KodeMK":"FI3272","CPMK":"Mampu memahami Sistem mekanikal robot, manipulator, sistem control mekanik","KodeCPL":"CPL 03"},{"KodeMK":"FI3272","CPMK":"Mampu memahami Konsep dasar gerak: translasi ke rotasi, gerak linier, greak berputar, kerja dan daya listrik , Actuator, control aktuator","KodeCPL":"CPL 03"},{"KodeMK":"FI3272","CPMK":"Mampu memahami dan dapat mengaplikasikan Sistem kontrol ruang frekuensi serta konsep dasar gerak: translasi ke rotasi, gerak linier, greak berputar, kerja dan daya listrik, Actuator, control actuator pada robot.","KodeCPL":"CPL 03"},{"KodeMK":"FI3272","CPMK":"Mampu memahami prinsip dasar image processing","KodeCPL":"CPL 04"},{"KodeMK":"FI3272","CPMK":"Mampu memahami cara pengaplikasian Image processing dalam sistem kontrol robot.","KodeCPL":"CPL 04"},{"KodeMK":"FI3272","CPMK":"Mampu memahami cara pengaplikasian fuzzy logic pada bidang instrumentasi dan robotik.","KodeCPL":"CPL 04"},{"KodeMK":"FI3272","CPMK":"Mampu melaporkan hasil karya nya dalam bentuk lisan ataupun tulisan","KodeCPL":"CPL 06"},{"KodeMK":"FI3272","CPMK":"Mampu bekerja secara efektif, baik secara individu maupun dalam grup","KodeCPL":"CPL 07"},{"KodeMK":"FI3291","CPMK":"Memahami Aplikasi Termodinamika Pada Berbagai Jenis energi","KodeCPL":"CPL 01"},{"KodeMK":"FI3291","CPMK":"Memahami Dasar-dasar Teknologi Konversi Energi","KodeCPL":"CPL 02"},{"KodeMK":"FI3291","CPMK":"Memahami Dasar-dasar Perubahan Fisika pada jenis energi yang berbeda-beda","KodeCPL":"CPL 06"},{"KodeMK":"FI3291","CPMK":"Mampu menjelaskan dan memperkirakan Besaran Energi yang dihasilkan dari sumber energi berbeda","KodeCPL":"CPL 07"},{"KodeMK":"FI3291","CPMK":"Memahami konsep dan aplikasi terkait Sustainabilitas dan Ketersediaan Sumber Energi","KodeCPL":"CPL 10"},{"KodeMK":"FI3291","CPMK":"Mampu Menjelaskan Pembangkit listrik dari sumber energi yang berbeda-beda","KodeCPL":"CPL 10"},{"KodeMK":"FI4001","CPMK":"Memiliki pengetahuan yang memadai tentang zat padat dengan struktur periodik (kristal) dan memahami besaran fisis yang dimilikinya","KodeCPL":"CPL 01"},{"KodeMK":"FI4001","CPMK":"Mampu menjelaskan pengaruh susunan atom dalam zat padat dengan struktur kristal terhadap karakteristik bahan terutama sifat termal, listrik dan magnetiknya","KodeCPL":"CPL 02"},{"KodeMK":"FI4001","CPMK":"Mampu menggunakan hukum fisika dalam zat padat dengan struktur kristal dan menghubungkannya dengan besaran yang diperoleh secara eksperimen","KodeCPL":"CPL 03"},{"KodeMK":"FI4001","CPMK":"Mampu melihat potensi aplikasi fisika zat padat untuk bidang lain secara luas, seperti energi, lingkungan, serta ilmu hayati","KodeCPL":"CPL 08"},{"KodeMK":"FI4002","CPMK":"Memahami konsep-konsep dasar fisika Nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI4002","CPMK":"Memahami sifat-sifat Inti Atom","KodeCPL":"CPL 01"},{"KodeMK":"FI4002","CPMK":"Menjelaskan, menganalisis, dan memecahkan masalah terkait fenomena nuklir dan konsep terkait","KodeCPL":"CPL 02"},{"KodeMK":"FI4002","CPMK":"Mendeskripsikan, menganalisis, serta memecahkan masalah interaksi dalam model standar","KodeCPL":"CPL 02"},{"KodeMK":"FI4002","CPMK":"Mendeskripsikan dan menjelaskan beberapa contoh terkait aplikasi Fisika Nuklir","KodeCPL":"CPL 03"},{"KodeMK":"FI4003","CPMK":"Mampu mengidentifikasi konsep-konsep Fisika yang diperlukan untuk memecahkan problem yang diberikan","KodeCPL":"CPL 01"},{"KodeMK":"FI4003","CPMK":"Mampu memformulasikan langkah penyelesaian problem fisis yang diberikan menggunakan pengetahuan fisika yang dimiliki","KodeCPL":"CPL 02"},{"KodeMK":"FI4003","CPMK":"Mampu menentukan solusi dari problem fisis yang diberikan","KodeCPL":"CPL 03"},{"KodeMK":"FI4003","CPMK":"Mampu menganalisa solusi yang didapat dari problem fisis yang diberikan","KodeCPL":"CPL 04"},{"KodeMK":"FI4003","CPMK":"Mampu menyampaikan argumentasi penyelesaian problem secara lisan dan tulisan dengan runut dan benar","KodeCPL":"CPL 06"},{"KodeMK":"FI4003","CPMK":"Menunjukkan keaktifan dan kontribusi kepada proses pembelajaran baik dalam kerja mandiri maupun dalam kelomplok","KodeCPL":"CPL 07"},{"KodeMK":"FI4003","CPMK":"Mampu mengaplikasikan pengetahuan fisika yang dimiliki untuk memecahkan problem secara holistik","KodeCPL":"CPL 08"},{"KodeMK":"FI4003","CPMK":"Menunjukkan karakter ilmuwan dalam unjuk kerjanya melalui kreativitas, penghargaan pada pendapat lain dan kejujuran","KodeCPL":"CPL 09"},{"KodeMK":"FI4003","CPMK":"Mampu mensintesa pengetahuan yang dimiliki untuk menyelesaikan suatu problem fisis yang lebih rumit (sophisticated)","KodeCPL":"CPL 10"},{"KodeMK":"FI4011","CPMK":"Mampu memahami konsep sederhana dan metode dalam geometri diferensial.","KodeCPL":"CPL 01"},{"KodeMK":"FI4011","CPMK":"Mengetahui aplikasinya terutama pada teori relativitas khusus dan teori medan klasik/kuantum.","KodeCPL":"CPL 02"},{"KodeMK":"FI4011","CPMK":"Mengetahui aplikasinya terutama pada teori relativitas khusus dan teori medan klasik/kuantum.","KodeCPL":"CPL 03"},{"KodeMK":"FI4011","CPMK":"Mengetahui aplikasinya terutama pada teori relativitas khusus dan teori medan klasik/kuantum.","KodeCPL":"CPL 04"},{"KodeMK":"FI4011","CPMK":"Mengetahui aplikasinya terutama pada teori relativitas khusus dan teori medan klasik/kuantum.","KodeCPL":"CPL 05"},{"KodeMK":"FI4091","CPMK":"Memiliki kemampuan berkomunikasi secara lisan dan menulis laporan ilmiah dalam format penulisan yang sesuai.","KodeCPL":"CPL 06"},{"KodeMK":"FI4091","CPMK":"Dapat bekerja mandiri dan bekerja sama dalam grup secara efektif.","KodeCPL":"CPL 07"},{"KodeMK":"FI4091","CPMK":"Dapat menggunakan konsep fisika dalam pemecahan masalah.","KodeCPL":"CPL 08"},{"KodeMK":"FI4091","CPMK":"Dapat membangun kreatifitas dan berpikir kritis, inovatif, serta menunjukkan kejujuran dan rasa tanggung jawab.","KodeCPL":"CPL 09"},{"KodeMK":"FI4091","CPMK":"Dapat melakukan riset mengenai suatu problem spesifik menggunakan metode ilmiah.","KodeCPL":"CPL 10"},{"KodeMK":"FI4091","CPMK":"Dapat memecahkan masalah secara sistematis dalam rentang waktu tertentu.","KodeCPL":"CPL 10"},{"KodeMK":"FI4092","CPMK":"Memiliki kemampuan berkomunikasi secara lisan dan menulis laporan ilmiah dalam format penulisan yang sesuai.","KodeCPL":"CPL 06"},{"KodeMK":"FI4092","CPMK":"Dapat bekerja mandiri dan bekerja sama dalam grup secara efektif.","KodeCPL":"CPL 07"},{"KodeMK":"FI4092","CPMK":"Dapat menggunakan konsep fisika dalam pemecahan masalah.","KodeCPL":"CPL 08"},{"KodeMK":"FI4092","CPMK":"Dapat membangun kreatifitas dan berpikir kritis, inovatif, serta menunjukkan kejujuran dan rasa tanggung jawab.","KodeCPL":"CPL 09"},{"KodeMK":"FI4092","CPMK":"Dapat melakukan riset mengenai suatu problem spesifik menggunakan metode ilmiah.","KodeCPL":"CPL 10"},{"KodeMK":"FI4092","CPMK":"Dapat memecahkan masalah secara sistematis dalam rentang waktu tertentu.","KodeCPL":"CPL 10"},{"KodeMK":"FI4111","CPMK":"Mahasiswa mampu menunjukkan pengetahuan dalam masalah sistem kuantum terbuka mulai dari matriks densitas hingga dinamika sistem kuantum terbuka","KodeCPL":"CPL 01"},{"KodeMK":"FI4111","CPMK":"Mahasiswa mampu untuk memformulasikan operator representasi dan dynamical map serta quantum channel","KodeCPL":"CPL 02"},{"KodeMK":"FI4111","CPMK":"Mahasiswa mampu untuk menunjukkan konsep dasar komputasi kuantum","KodeCPL":"CPL 03"},{"KodeMK":"FI4111","CPMK":"Mahasiswa mampu mengidentifikasi, memformulasi dan menyelesaikan masalah aplikasi komputasi kuantum","KodeCPL":"CPL 04"},{"KodeMK":"FI4111","CPMK":"Mahasiswa mampu menunjukkan dan mengaplikasikan algoritma kuantum","KodeCPL":"CPL 04"},{"KodeMK":"FI4121","CPMK":"Memahami karakteristik material lunak jenis polimer, koloid, kristal cair dan surfaktan (molekul ampifilik).","KodeCPL":"CPL 01"},{"KodeMK":"FI4121","CPMK":"Memahami sifat fisis material lunak (gaya, energi, timescales, sifat viskoelastik dan transisi fase).","KodeCPL":"CPL 01"},{"KodeMK":"FI4121","CPMK":"Memahami sifat fisis materi (sifat konduksi panas dan listrik, sifat magnetik dan sifat optik).","KodeCPL":"CPL 01"},{"KodeMK":"FI4121","CPMK":"Memahami sifat susceptibilitas listrik dan karakteristik ferroelektrik dan paraelektrik, serta memahami sifat susceptibilitas magnetik dan karakteristik ferromagnetik dan paramagnetik.","KodeCPL":"CPL 01"},{"KodeMK":"FI4121","CPMK":"Memahami dan memiliki pengalaman sintesis material lunak dan serta melakukan karakterisasi sifat fisisnya.","KodeCPL":"CPL 05"},{"KodeMK":"FI4121","CPMK":"Memahami fungsionalisasi material lunak untuk aplikasi yang terkait dengan bidang kesehatan sebagai biosensor dan divais optoelektronik.","KodeCPL":"CPL 08"},{"KodeMK":"FI4121","CPMK":"Memahami sifat konduksi panas dan listrik serta aplikasinya termopower dan termoelektrik.","KodeCPL":"CPL 08"},{"KodeMK":"FI4122","CPMK":"Mampu memahami perangkat teori dan teknik untuk menggambarkan fenomena yang terjadi dalam skala elektronik.","KodeCPL":"CPL 04"},{"KodeMK":"FI4122","CPMK":"Mampu memahami pendekatan yang diterapkan dalam peranti lunak simulasi material.","KodeCPL":"CPL 04"},{"KodeMK":"FI4122","CPMK":"Mampu memahami istilah yang relevan dan lazim digunakan dalam penggambaran sifat bahan.","KodeCPL":"CPL 10"},{"KodeMK":"FI4131","CPMK":"Mahasiswa memahami prinsip kerja divais elektronik dan oiptoelektronik","KodeCPL":"CPL 01"},{"KodeMK":"FI4131","CPMK":"Mahasiswa memahami proses fabrikasi divais","KodeCPL":"CPL 01"},{"KodeMK":"FI4131","CPMK":"Mahasiswa mengetahui perkembangan divais elektronik dan optoelektronik","KodeCPL":"CPL 01"},{"KodeMK":"FI4141","CPMK":"Mampu melakukan analisis termal hidrolik dari suatu sistem reaktor nuklir","KodeCPL":"CPL 04"},{"KodeMK":"FI4141","CPMK":"Mampu melakukan analisis keselamatan dari suatu sistem reaktor nuklir","KodeCPL":"CPL 04"},{"KodeMK":"FI4141","CPMK":"Dapat membuat program simulasi transfer kalor untuk kasus kecelakaan reaktor","KodeCPL":"CPL 04"},{"KodeMK":"FI4142","CPMK":"Mengetahui dan menganalisis konsep keamanan dan non-proliferasi nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI4142","CPMK":"Mengetahui dan mampu melakukan analisis konsep 3 S, safety, security dan safeguard","KodeCPL":"CPL 01"},{"KodeMK":"FI4142","CPMK":"Mengetahui dan mampu menganalisis konsep depence in depth dalam system keselamatan dan keamanan nuklir","KodeCPL":"CPL 04"},{"KodeMK":"FI4142","CPMK":"Mengetahui dan mampu menganalisis non-proliferasi nuklir pada bahan bakar, protected plutonium proliferation dan konsep attractivenesss","KodeCPL":"CPL 04"},{"KodeMK":"FI4142","CPMK":"Mampu menyelesaikan Research Based Learning (RBL) terkait mata kuliah","KodeCPL":"CPL 05"},{"KodeMK":"FI4151","CPMK":"menguasai konsep-konsep dan prinsip-prinsip dasar dan lanjut radiasi pengion pada bidang terapi medis.","KodeCPL":"CPL 01"},{"KodeMK":"FI4151","CPMK":"menerapkan pemahaman tentang konsep dan prinsip radiasi pengion untuk meningkatkan kualitas terapi radiasi di bidang medis.","KodeCPL":"CPL 01"},{"KodeMK":"FI4151","CPMK":"menggunakan pemahaman tentang konsep dan prinsip radiasi pengion untuk pengembangan terapi radiasi medis.","KodeCPL":"CPL 01"},{"KodeMK":"FI4151","CPMK":"mengembangkan diri secara berkelanjutan dalam mengikuti perkembangan ilmu dan teknologi pada bidang terapi radiasi medis.","KodeCPL":"CPL 08"},{"KodeMK":"FI4152","CPMK":"menguasai konsep-konsep dan prinsip-prinsip dasar dan lanjut radiasi pengion pada bidang kedokteran nuklir.","KodeCPL":"CPL 01"},{"KodeMK":"FI4152","CPMK":"menerapkan pemahaman tentang konsep dan prinsip radiasi pengion untuk meningkatkan kualitas diagnostik dan terapi di bidang kedokteran nuklir.","KodeCPL":"CPL 01"},{"KodeMK":"FI4152","CPMK":"menggunakan pemahaman tentang konsep dan prinsip radiasi pengion untuk pengembangan diagnostik dan terapi di bidang kedokteran nuklir.","KodeCPL":"CPL 01"},{"KodeMK":"FI4152","CPMK":"mengembangkan diri secara berkelanjutan dalam mengikuti perkembangan ilmu dan teknologi pada bidang kedokteran nuklir.","KodeCPL":"CPL 04"},{"KodeMK":"FI4161","CPMK":"Mampu menggunakan teknik inversi untuk berbagai aplikasi.","KodeCPL":"CPL 08"},{"KodeMK":"FI4162","CPMK":"Mampu mengaplikasikan metode Fisika Bumi di lapangan.","KodeCPL":"CPL 05"},{"KodeMK":"FI4171","CPMK":"Memahami aplikasi instrumentasi dan komputasi untuk memecahkan masalah fisika.","KodeCPL":"CPL 03"},{"KodeMK":"FI4171","CPMK":"Mampu mengaplikasikan instrumentasi dan komputasi untuk membantu memecahkan permasalahan fisika, khususnya terkait eksperimen.","KodeCPL":"CPL 04"},{"KodeMK":"FI4171","CPMK":"Mampu mengembangkan sistem instrumentasi dan komputasi untuk membantu memecahkan permasalahan fisika","KodeCPL":"CPL 06"},{"KodeMK":"FI4171","CPMK":"Mampu bekerja efektif, baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI4171","CPMK":"Mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan masalah-masalah sistem fisis.","KodeCPL":"CPL 09"},{"KodeMK":"FI4172","CPMK":"Memahami aplikasi sains data dan komputasi untuk memecahkan masalah fisika.","KodeCPL":"CPL 03"},{"KodeMK":"FI4172","CPMK":"Mampu mengaplikasikan sains data dan komputasi untuk membantu memecahkan permasalahan fisika, khususnya terkait eksperimen.","KodeCPL":"CPL 04"},{"KodeMK":"FI4172","CPMK":"Mampu mengembangkan sistem sains data dan komputasi untuk membantu memecahkan permasalahan fisika","KodeCPL":"CPL 06"},{"KodeMK":"FI4172","CPMK":"Mampu bekerja efektif, baik secara individu maupun dalam grup.","KodeCPL":"CPL 07"},{"KodeMK":"FI4172","CPMK":"Mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan masalah-masalah sistem fisis","KodeCPL":"CPL 09"},{"KodeMK":"FI4191","CPMK":"Mampu menerapkan konsep/prinsip/hukum FIsika terkait dengan system transisi energi","KodeCPL":"CPL 01"},{"KodeMK":"FI4191","CPMK":"Mampu melakukan analisis data secara numerik untuk problem energi yang ada","KodeCPL":"CPL 01"},{"KodeMK":"FI4191","CPMK":"Mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan problematika sistem transisi energi","KodeCPL":"CPL 04"},{"KodeMK":"FI4191","CPMK":"Mampu melaporkan hasil karya nya dalam bentuk lisan ataupun tulisan","KodeCPL":"CPL 06"},{"KodeMK":"FI4221","CPMK":"Memahami dan dapat menjelaskan interaksi antara atom dan medan elektromagnetik menggunakan pendekatan semiklasik.","KodeCPL":"CPL 02"},{"KodeMK":"FI4221","CPMK":"Memahami dan dapat menjelaskan interaksi antara atom dan medan elektromagnetik menggunakan pendekatan kuantum.","KodeCPL":"CPL 02"},{"KodeMK":"FI4221","CPMK":"Memahami dan dapat menjelaskan fenomena emisi spontan yang hanya dapat dijelaskan dengan baik oleh pendekatan kuantum.","KodeCPL":"CPL 02"},{"KodeMK":"FI4221","CPMK":"Memahami dan dapat menjelaskan aspek kuantum dari foton dan aplikasinya dalam teknologi kuantum.","KodeCPL":"CPL 02"},{"KodeMK":"FI4221","CPMK":"Menganalisa interaksi antara atom dan medan elektromagnetik dengan mengaplikasikan prinsip-prinsip mekanika klasik dan kuantum.","KodeCPL":"CPL 04"},{"KodeMK":"FI4221","CPMK":"Menganalisa sistem qubit dengan mengaplikasikan metode informasi dan komputasi kuantum.","KodeCPL":"CPL 04"},{"KodeMK":"FI4231","CPMK":"Mahasiswa memahami prinsip kerja divais nano","KodeCPL":"CPL 01"},{"KodeMK":"FI4231","CPMK":"Mahasiswa memahami proses fabrikasi divais nano","KodeCPL":"CPL 01"},{"KodeMK":"FI4231","CPMK":"Mahasiswa mengetahui divais nano dan potensi pengembangannya untuk masa depan","KodeCPL":"CPL 01"},{"KodeMK":"FI4231","CPMK":"Mampu menjelaskan fenomena kuantum untuk divais fungsional.","KodeCPL":"CPL 08"},{"KodeMK":"FI4231","CPMK":"Mampu menjelaskan prinsip-prinsip dasar fisika kuantum, termasuk superposisi, entanglement, dan ketidakpastian.","KodeCPL":"CPL 08"},{"KodeMK":"FI4231","CPMK":"Mampu menjelaskan aplikasi nanoteknologi dan penggunaan nanomaterial dalam pengembangan divais kuantum.","KodeCPL":"CPL 08"},{"KodeMK":"FI4231","CPMK":"Mampu menjelaskan aplikasi teknologi divais kuantum dalam bidang komputasi kuantum","KodeCPL":"CPL 09"},{"KodeMK":"FI4241","CPMK":"Memformulasikan persoalan tingkat lanjut dalam fisika nuklir","KodeCPL":"CPL 02"},{"KodeMK":"FI4241","CPMK":"Memformulasikan solusi numerik dalam bentuk algoritma rinci","KodeCPL":"CPL 02"},{"KodeMK":"FI4241","CPMK":"Melakukan pemrograman untuk memecahkan masalah yang diberikan","KodeCPL":"CPL 04"},{"KodeMK":"FI4241","CPMK":"Melakukan trouble shooting sampai program yang dibuat berfungsi baik, dilakukan secara berkelompok","KodeCPL":"CPL 04"},{"KodeMK":"FI4241","CPMK":"Melakukan verifikasi hasil yang diperoleh","KodeCPL":"CPL 04"},{"KodeMK":"FI4241","CPMK":"Mempresentasikan hasil yang diperoleh","KodeCPL":"CPL 06"},{"KodeMK":"FI4241","CPMK":"Merekomendasikan pengembangan lebih lanjut","KodeCPL":"CPL 08"},{"KodeMK":"FI4242","CPMK":"Mengetahui tentang perkembangan terkini di bidang rekayasa energi nuklir","KodeCPL":"CPL 01"},{"KodeMK":"FI4242","CPMK":"Melakukan identifikasi riset dan perkembangan dalam disiplin rekayasa energi nuklir yang mungkin menjadi bahan penelitian tugas akhir","KodeCPL":"CPL 05"},{"KodeMK":"FI4242","CPMK":"Mengevaluasi tema system energi nuklir dari aspek netronik, termal-hidrolik, keselamatan dan termodinamika reactor.","KodeCPL":"CPL 06"},{"KodeMK":"FI4242","CPMK":"Mengevaluasi tema system energi nuklir untuk aplikasi Listrik dan ko-generasi.","KodeCPL":"CPL 07"},{"KodeMK":"FI4242","CPMK":"Mampu menjelaskan dan menunjukkan dalam kasus sederhana sistem energi nuklir","KodeCPL":"CPL 08"},{"KodeMK":"FI4242","CPMK":"Mampu mengerjakan research based learning (RBL) terkait sistem energi nuklir","KodeCPL":"CPL 09"},{"KodeMK":"FI4251","CPMK":"menguasai konsep-konsep dan prinsip-prinsip dasar dan lanjut radiasi pengion pada bidang fisika kesehatan dan proteksi radiasi.","KodeCPL":"CPL 01"},{"KodeMK":"FI4251","CPMK":"menerapkan pemahaman tentang konsep dan prinsip radiasi pengion untuk meningkatkan kualitas perancangan sistem proteksi dan keselamatan radiasi.","KodeCPL":"CPL 01"},{"KodeMK":"FI4251","CPMK":"menggunakan pemahaman tentang konsep dan prinsip radiasi pengion untuk pengembangan perancangan sistem proteksi dan keselamatan radiasi","KodeCPL":"CPL 04"},{"KodeMK":"FI4251","CPMK":"mengembangkan diri secara berkelanjutan dalam mengikuti perkembangan ilmu dan teknologi pada bidang fisika kesehatan dan proteksi radiasi.","KodeCPL":"CPL 08"},{"KodeMK":"FI4252","CPMK":"menguasai konsep-konsep dan prinsip-prinsip dasar dan lanjut interaksi radiasi pengion dengan sistem biologi","KodeCPL":"CPL 01"},{"KodeMK":"FI4252","CPMK":"menggunakan pemahaman tentang konsep dan prinsip radiasi pengion untuk pengembangan pemodelan yang digunakan pada bidang radiobiologi.","KodeCPL":"CPL 02"},{"KodeMK":"FI4252","CPMK":"menerapkan pemahaman tentang konsep dan prinsip radiasi pengion dan sistem biologi untuk mengoptimasi penggunaan radiasi pengion dalam terapi medis.","KodeCPL":"CPL 08"},{"KodeMK":"FI4252","CPMK":"mengembangkan diri secara berkelanjutan dalam mengikuti perkembangan ilmu dan teknologi pada bidang radiobiologi.","KodeCPL":"CPL 10"},{"KodeMK":"FI4253","CPMK":"memahami terminologi medis, mengidentifikasi secara kasar struktur anatomi,","KodeCPL":"CPL 06"},{"KodeMK":"FI4253","CPMK":"mendeskripsikan mekanisme fisiologi untuk perbaikan, perawatan, dan pertumbuhan.","KodeCPL":"CPL 06"},{"KodeMK":"FI4253","CPMK":"mendefinisikan sebagian besar sistem organ.","KodeCPL":"CPL 07"},{"KodeMK":"FI4261","CPMK":"Mampu memformulasi sistem fisika lingkungan ke dalam model fisis dengan menggunakan matematika.","KodeCPL":"CPL 02"},{"KodeMK":"FI4261","CPMK":"Mampu memformulasi sistem migas nonkonvensional ke dalam model fisis dengan menggunakan matematika.","KodeCPL":"CPL 02"},{"KodeMK":"FI4261","CPMK":"Mampu memecahkan masalah fisika lingkungan migas nonkonvensional secara komprehensif menggunakan matematika dan perangkat komputasi.","KodeCPL":"CPL 03"},{"KodeMK":"FI4261","CPMK":"Mampu menganalisis persoalan fisika lingkungan migas nonkonvensional dengan mengaplikasikan matematika dan perangkat komputasi/ICT","KodeCPL":"CPL 04"},{"KodeMK":"FI4262","CPMK":"Mahasiswa memahami tentang relasi antara dinamika kerak bumi, mekanisme deformasi batuan pada bencana alam maupun bencana yang dipicu oleh tindakan manusia, serta bagaimana cara mitigasi bencananya","KodeCPL":"CPL 01"},{"KodeMK":"FI4262","CPMK":"Mahasiswa mampu memahami konsep relasi stress, strain dan hukum Hooke pada batuan dari segi teori, laboratorium, dapat mengaplikasikannya dalam konfigurasi sederhana.","KodeCPL":"CPL 02"},{"KodeMK":"FI4262","CPMK":"Mahasiswa mampu memahami konsep terbentuknya tipe-tipe fault pada lempeng batuan pada batuan dari segi teori, laboratorium, dapat mengaplikasikannya pada kasus lapangan riil dan industri","KodeCPL":"CPL 02"},{"KodeMK":"FI4262","CPMK":"Mahasiswa mampu berfikir komprehensif mengintegrasikan data kualitatif dari fenomena geologi dan perhitungan kuantitatif stress bawah permukaan dan pemakaian batas failure kriteria untuk memitigasi struktur tetap stabil dan tidak terjadi bencana","KodeCPL":"CPL 04"},{"KodeMK":"FI4262","CPMK":"Mahasiswa mengenal mekanisme longsoran, pemodelannya dan cara membuat lereng yang stabil, dan didemonstasikan pemodelan perangkat lunaknya","KodeCPL":"CPL 05"},{"KodeMK":"FI4262","CPMK":"Mahasiswa faham cara pemodelan stress bawah permukaan mendasarkan parameter geomekanik dan bisa memakai atau setidaknya didemonstrasikan cara pemakaian perangkat lunak modelingnya","KodeCPL":"CPL 05"},{"KodeMK":"FI4262","CPMK":"Mahasiswa mengenal cara stabilisasi pembuatan terowongan dan lobang bor","KodeCPL":"CPL 05"},{"KodeMK":"KI1101","CPMK":"Mampu menerapkan konsep kimia yang relevan untuk menyelesaikan pesoalan kimia dasar.","KodeCPL":"CPL 01"},{"KodeMK":"KI1101","CPMK":"Mampu menerapkan konsep kimia untuk aplikasi yang relevan.","KodeCPL":"CPL 01"},{"KodeMK":"KI1201","CPMK":"Mampu menerapkan konsep kimia yang relevan untuk menyelesaikan pesoalan kimia dasar.","KodeCPL":"CPL 01"},{"KodeMK":"KI1201","CPMK":"Mampu menerapkan konsep kimia untuk aplikasi yang relevan.","KodeCPL":"CPL 01"},{"KodeMK":"KI1201","CPMK":"Mampu memahami prinsip dasar dan menyiapkan perencanaan eksperimen","KodeCPL":"CPL 05"},{"KodeMK":"KI1201","CPMK":"Trampil menggunakan peralatan dasar yang relevan untuk eksperimen","KodeCPL":"CPL 05"},{"KodeMK":"MA1101","CPMK":"Mengenali suatu fenomena di dunia nyata sebagai tingkat perubahan atau akumulasi perubahan kemudian merumuskan dengan menggunakan kosa-kata matematika.","KodeCPL":"CPL 01"},{"KodeMK":"MA1101","CPMK":"Mengkaji dan menjelaskan fenomena perubahan suatu besaran, melalui berbagai strategi, dengan menggunakan konsep-konsep dasar kalkulus satu peubah, khususnya turunan (konsep tingkat perubahan) dan integral (konsep akumulasi perubahan).","KodeCPL":"CPL 02"},{"KodeMK":"MA1101","CPMK":"Menyelesaikan masalah nyata dengan menggunakan kalkulus satu peubah dan memanfaatkan teknologi sebagai alat bantu, jika diperlukan.","KodeCPL":"CPL 03"},{"KodeMK":"MA1101","CPMK":"Mengungkapkan gagasan tentang perubahan suatu besaran dan menyusun argumen untuk meyakinkan, secara lisan maupun tertulis, dalam bahasa sendiri termasuk memberi penafsiran dalam konteks matematika maupun di luar matematika.","KodeCPL":"CPL 06"},{"KodeMK":"MA1101","CPMK":"Menelaah dan menyajikan informasi matematika secara simbolik, diagram, tabel, maupun grafik.","KodeCPL":"CPL 06"},{"KodeMK":"MA1101","CPMK":"Menggunakan matematika untuk menganalisis dan menyelesaikan berbagai masalah, baik di dunia nyata maupun dalam berbagai disiplin ilmu, sains, rekayasa, ilmu hayati, maupun bisnis, untuk membangun sikap-sikap seperti kepercayaan diri, gigih, terbuka, dan lainnya.","KodeCPL":"CPL 08"}]