[{"KodeMK":"FI5001","CPMK":"Mahasiswa mampu memahami konsep mekanika Lagrange dan dapat mengaplikasikannya dalam konfigurasi sederhana.","KodeCPL":"CPL 2"},{"KodeMK":"FI5001","CPMK":"Mahasiswa mampu memahami konsep formulasi Hamilton dan ruang fasa dalam sistem mekanika.","KodeCPL":"CPL 2"},{"KodeMK":"FI5001","CPMK":"Mahasiswa mengenal prinsip simetri dalam sistem mekanika.","KodeCPL":"CPL 4"},{"KodeMK":"FI5001","CPMK":"Mahasiswa mengenal formulasi Lagrange dan Hamilton untuk sistem dan medan kontinu","KodeCPL":"CPL 4"},{"KodeMK":"FI5002","CPMK":"Mahasiswa mampu mengenal prinsip dasar mekanika kuantum","KodeCPL":"CPL 2"},{"KodeMK":"FI5002","CPMK":"Mahasiswa mampu memahami operator dan keadaan kuantum","KodeCPL":"CPL 2"},{"KodeMK":"FI5002","CPMK":"Mahasiswa mampu memahami persamaan dinamika kuantum dan mengaplikasikannya pada sistem sederhana","KodeCPL":"CPL 2"},{"KodeMK":"FI5002","CPMK":"Mahasiswa mampu memahami prinsip simetri dalam teori kuantum","KodeCPL":"CPL 4"},{"KodeMK":"FI5002","CPMK":"Mahasiswa dapat mengaplikasikan teori gangguan kuantum baik stasioner maupun nonstasioner","KodeCPL":"CPL 4"},{"KodeMK":"FI5003","CPMK":"Mahasiswa memiliki pemahaman dan penguasaan yang lengkap tentang teori medan elektrostatika dan magnetostatika serta aplikasinya","KodeCPL":"CPL 2"},{"KodeMK":"FI5003","CPMK":"Mahasiswa memiliki pemahaman dan penguasaan teori medan elektrodinamika dan karakteristik gelombang elektromagnetik","KodeCPL":"CPL 2"},{"KodeMK":"FI5003","CPMK":"Mahasiswa mampu merumuskan dan memecahkan persoalan elektrodinamika serta memahami konsekuensinya","KodeCPL":"CPL 2"},{"KodeMK":"FI5003","CPMK":"Mahasiswa mampu menerapkan teori medan elektrodinamika untuk keperluan analisis gejala elektrodinamika dalam ruang bebas dan pandu gelombang","KodeCPL":"CPL 2"},{"KodeMK":"FI5003","CPMK":"Mahasiswa mampu menerapkan teori medan elektrodinamika pada analisis interaksi gelombang elektromagnetik dengan bahan","KodeCPL":"CPL 2"},{"KodeMK":"FI5003","CPMK":"Mahasiswa mampu memahami gejala hamburan dan radiasi gelombang elektromagnetik","KodeCPL":"CPL 4"},{"KodeMK":"FI5211","CPMK":"Mahasiswa mampu memahami konsep ruang waktu beserta perumusan tensor di dalamnya","KodeCPL":"CPL 2"},{"KodeMK":"FI5211","CPMK":"Mahasiswa mampu memahami contoh-contoh ruang waktu statis dan dinamik beserta penggunaannya","KodeCPL":"CPL 2"},{"KodeMK":"FI5211","CPMK":"Mahasiswa mampu memahami solusi lubang hitam Schwarzchild dan properti-propertinya","KodeCPL":"CPL 2"},{"KodeMK":"FI5211","CPMK":"Mahasiswa mampu mengenal formulasi umum solusi lubang hitam dan termodinamikanya.","KodeCPL":"CPL 4"},{"KodeMK":"FI5212","CPMK":"Memahami perumusan teori medan klasik beserta perumusan kuantum seperti kuantisasi kanonis dan integral lintas Feynman","KodeCPL":"CPL 2"},{"KodeMK":"FI5212","CPMK":"Mahasiswa mampu memahami formulasi perturbasi dan diagram Feynman","KodeCPL":"CPL 2"},{"KodeMK":"FI5212","CPMK":"Mahasiswa mampu memahami perumusan kuantum untuk proses hamburan sederhana beserta penggunaannya","KodeCPL":"CPL 2"},{"KodeMK":"FI6111","CPMK":"Mahasiswa mampu memahami konsep diagram Feynman untuk satu loop beserta konsep renormalisasi","KodeCPL":"CPL 2"},{"KodeMK":"FI6111","CPMK":"Mahasiswa mampu memahami penggunaan pengrusakan simetri spontan dalam model Glashow-Weinberg-Salam","KodeCPL":"CPL 4"},{"KodeMK":"FI6011","CPMK":"Mahasiswa mampu memahami konsep kuantum informasi dan kuantum informasi","KodeCPL":"CPL 4"},{"KodeMK":"FI6011","CPMK":"Mahasiswa mampu memahami penggunaan konsep kuantum pada sistem makhluk hidup","KodeCPL":"CPL 2"},{"KodeMK":"FI5161","CPMK":"Mahasiswa memahami pemakaian medan potensial untuk pencitraan bawah permukaan","KodeCPL":"CPL 1"},{"KodeMK":"FI5161","CPMK":"Mahasiswa memahami pemakaian medan gelombang seismik untuk pencitraan bawah","KodeCPL":"CPL 1"},{"KodeMK":"FI5161","CPMK":"Mahasiswa mampu memahami sifat elastik batuan, sifat kelistrikan dalam pori batuan dan bumi, termasuk petrofisika well logging","KodeCPL":"CPL 2"},{"KodeMK":"FI5161","CPMK":"Mahasiswa mampu memahami cara merekonstruksi medan potensial dan medan gelombang untuk mencitrakan bawah permukaan bumi","KodeCPL":"CPL 2"},{"KodeMK":"FI5161","CPMK":"Mahasiswa mampu menerapkan pemahaman teknik inversi untuk mencitrakan bawah permukaan bumi dan batuan","KodeCPL":"CPL 3"},{"KodeMK":"FI5161","CPMK":"Mahasiswa mampu memahami ilmu lintas bidang dari uji laboratorium, well logging, data inversi medan gelombang seismik atau medan potensial untuk menghitung cadangan sumber daya alam","KodeCPL":"CPL 4"},{"KodeMK":"FI5161","CPMK":"Mahasiswa mampu memahami ilmu lintas bidang dari uji laboratorium, well logging, data inversi medan gelombang seismik atau medan potensial untuk mengukur dinamika pergerakan bawah permukaan","KodeCPL":"CPL 4"},{"KodeMK":"FI5162","CPMK":"Mahasiswa mampu memahami konseptual medan listrik dan medan gelombang untuk pencitraaan bawah permukaan","KodeCPL":"CPL 1"},{"KodeMK":"FI5162","CPMK":"Mahasiswa memahami struktur mikrogeometri batuan","KodeCPL":"CPL 1"},{"KodeMK":"FI5162","CPMK":"Mahasiswa memahami besaran mikrogeometeri batuan","KodeCPL":"CPL 1"},{"KodeMK":"FI5162","CPMK":"Mahasiswa mampu memahami sifat elsatik batuan, sifat kelistrikan dan aliran fluida dalam batuan.","KodeCPL":"CPL 2"},{"KodeMK":"FI5162","CPMK":"Mahasiswa mampu menerapkan pemahaman tentang sifat elastik batuan, sifat kelistrikan dan aliran fluida dalam batuan untuk keperluan bidang terkait.","KodeCPL":"CPL 2"},{"KodeMK":"FI5162","CPMK":"Mahasiswa mampu menyelesaikan studi kasus karakterisasi batuan menggunakan metoda seismik dan kelsitrikan dalam industri dan kaitannya dengan bidang lain.","KodeCPL":"CPL 3"},{"KodeMK":"FI5162","CPMK":"Mahasiswa mampu memahami perkembangan keilmuan dalam bidang fisika batuan beserta terapannya dalam berbagai bidang.","KodeCPL":"CPL 4"},{"KodeMK":"FI5162","CPMK":"Mahasiswa mampu membuat kode komputasi untuk penghitungan besaran fisika batuan.","KodeCPL":"CPL 5"},{"KodeMK":"FI6161","CPMK":"Memahami konsep interior bumi","KodeCPL":"CPL 1"},{"KodeMK":"FI6161","CPMK":"Mampu berpikir secara sistemis dan memiliki pola pikir yang logis untuk merumuskan dan memecahkan masalah kebumian yang berhubngan dengan erupsi gunung api dan pemodelan reservoir panas bumi.","KodeCPL":"CPL 1"},{"KodeMK":"FI6161","CPMK":"Mampu menerapkan prinsip fisika dalam konsep umum model gunung api dan reservior panas bumi.","KodeCPL":"CPL 2"},{"KodeMK":"FI6161","CPMK":"Mampu bekerja dengan baik secara mandiri melihat kaitan gyng api dan panasbumi dengan ilmu lain dalam bidang yang terkait (Geologi, Geohidrologi, Geodesi, Geokimia)","KodeCPL":"CPL 3"},{"KodeMK":"FI6161","CPMK":"Adaptif terhadap perkembangan ilmu pengetahuan dalam gunung api dan panas bumi melajui membaca jurnal-jurnal terbaru.","KodeCPL":"CPL 4"},{"KodeMK":"FI6261","CPMK":"Mampu memahami Tipe Sumber Daya Bumi dan proses pembentukannya","KodeCPL":"CPL 1"},{"KodeMK":"FI6261","CPMK":"Memahami konsep pengendapan batuan, tektonika dalam hubungannya dengan proses pembentukan sumber daya bumi yang bisa dimanfaatkan untuk manusia","KodeCPL":"CPL 2"},{"KodeMK":"FI6261","CPMK":"Mampu berpikir secara sistemis dan memiliki pola pikir yang logis untuk merumuskan dan memecahkan masalah cadangan sumberdaya bumi dengan mempergunakan perangkat berbasiskan fisika.","KodeCPL":"CPL 3"},{"KodeMK":"FI6261","CPMK":"Mampu memahami metode geofisika untuk mengukur cadangan sumber daya bumi di bawah permukaan bumi, diantarnya: Gravity, Magnet, Elektromagnetik, Seismik, Resistivitas, Well-Logging","KodeCPL":"CPL 4"},{"KodeMK":"FI6261","CPMK":"Mengetahui cara penggunaan geostatistik untuk perhitungan spasial, maupun kecerdasan buatan (machine learning) untuk mencari cadangan mineral dan energi, serta untuk penentuan besar cadangannya secara keekonomian","KodeCPL":"CPL 5"},{"KodeMK":"FI5121","CPMK":"Mahasiswa mampu identifikasi besaran-besaran fisika yang berkaitan dengan deskripsi sistem elektronik bahan","KodeCPL":"CPL 1"},{"KodeMK":"FI5121","CPMK":"Mahasiswa mampu menerapkan persamaan Schrodinger dan modifikasinya untuk berbagai model fisis bahan padat dengan menggunakan matematika.","KodeCPL":"CPL 2"},{"KodeMK":"FI5121","CPMK":"Mahasiswa mampu mendapatkan berbagai informasi besaran fisis sistem elektronik bahan dengan menerapkan DFT","KodeCPL":"CPL 2"},{"KodeMK":"FI5121","CPMK":"Mahasiswa mampu menganalisis berbagai sifat elektronik dan magnetik bahan  dengan menerapkan DFT.","KodeCPL":"CPL 2"},{"KodeMK":"FI5121","CPMK":"Mahasiswa mampu menunjukkan aplikasi penerapan DFT dalam memecahkan berbagai persoalan elektronik dan magnetik bahan padat.","KodeCPL":"CPL 4"},{"KodeMK":"FI5221","CPMK":"Mahasiswa mampu menjelaskan representasi citra analog dan digital","KodeCPL":"CPL 1"},{"KodeMK":"FI5221","CPMK":"Mahasiswa mampu menjelaskan konsep sistem linear, analisis spectral, fungsi transfer dan penapisan","KodeCPL":"CPL 1"},{"KodeMK":"FI5221","CPMK":"Mahasiswa mampu memecahkan masalah pemindaian optik secara pasif dan aktif, permukaan dan 3 dimensi","KodeCPL":"CPL 2"},{"KodeMK":"FI5221","CPMK":"Mahasiswa mampu memahami dan menganalisis prinsip pembentukan citra secara optika geometri, optika Fourier, teori optika skalar dan vektorial serta efek difraksi","KodeCPL":"CPL 2"},{"KodeMK":"FI5221","CPMK":"Mahasiswa mampu memahami dan menganalisis prinsip pencitraan interferometrik, pencitraan tiga dimensi dan visualisasi holografi","KodeCPL":"CPL 2"},{"KodeMK":"FI5221","CPMK":"Mahasiswa mampu memahami prinsip pencitraan maju mikroskopik, koheren dan tomografi, pencitraan dalam domain frekuensi dan temporal","KodeCPL":"CPL 4"},{"KodeMK":"FI6121","CPMK":"Mengenal perubahan berdasarkan pendekatan transisi fasa.","KodeCPL":"CPL 1"},{"KodeMK":"FI6121","CPMK":"Mengenal sifat fungsional bahan dalam teknologi sekarang dan masa depan.","KodeCPL":"CPL 1"},{"KodeMK":"FI6121","CPMK":"Mengenal dasar-dasar pencarian sifat fungsional dari suatu material.","KodeCPL":"CPL 1"},{"KodeMK":"FI6121","CPMK":"Memahami penerapan material fungsional pada suatu teknologi","KodeCPL":"CPL 4"},{"KodeMK":"FI6121","CPMK":"Memahami perumusan kinerja fungsionalitas suatu material.","KodeCPL":"CPL 4"},{"KodeMK":"FI6221","CPMK":"Mahasiswa mampu menceritakan kemajuan mutahir dalam metoda sintesis bahan magnetik dan fotonik serta pengukuran sifat magnetik dan fotoniknya","KodeCPL":"CPL 1"},{"KodeMK":"FI6221","CPMK":"Mahasiswa mampu memformulasikan dasar fisika pada kemajuan mutahir fenomena magnetik dan fotonik","KodeCPL":"CPL 1"},{"KodeMK":"FI6221","CPMK":"Mahasiswa mampu menganalisa kemajuan mutahir dalam fungsionalisasi dan aplikasi dari fenomena serta bahan magnetik dan fotonik","KodeCPL":"CPL 1"},{"KodeMK":"FI6221","CPMK":"Mahasiswa mampu mengaplikasikan pemahaman fenomena mutahir dari sifat magnetik dan fotonik dalam bidang lain misalnya biomedis, pertahanan dan lainnya.","KodeCPL":"CPL 4"},{"KodeMK":"FI6221","CPMK":"Memiliki bekal pengetahuan lanjut dalam bidang material magnetik dan fotonik fungsional","KodeCPL":"CPL 4"},{"KodeMK":"FI5271","CPMK":"Mahasiswa mampu berpikir kritis, logis, sistematis dan terstruktur dalam menyelesaikan masalah-masalah sistem fisis.","KodeCPL":"CPL 1"},{"KodeMK":"FI5271","CPMK":"Mahasiswa mampu menerapkan konsep/prinsip/hukum Fisika terkait dengan system fisis serta mencari solusi dari model fisis tersebut secara komputasi","KodeCPL":"CPL 2"},{"KodeMK":"FI5271","CPMK":"Mahasiswa mampu melakukan analisis secara numerik untuk problem fisis yang ada","KodeCPL":"CPL 2"},{"KodeMK":"FI5271","CPMK":"Mahasiswa mampu memanfaatkan teknologi informasi kekinian dalam untuk interpretasi data suatu ssstem fisika","KodeCPL":"CPL 4"},{"KodeMK":"FI5271","CPMK":"Mahasiswa mampu menerapkan komputasi sebagai tools untuk analisis dan interpretasi data eksperimen maupun hasil komputasi dari pemodelan sistem fisis","KodeCPL":"CPL 5"},{"KodeMK":"FI5171","CPMK":"Mampu menunjukkan pengetahuan tentang definisi Nanopartikel dan Nanomaterials.","KodeCPL":"CPL 2"},{"KodeMK":"FI5171","CPMK":"Mampu menunjukkan pengetahuan tentang sifat dasar dari Nanopartikel dan Nanomaterials.","KodeCPL":"CPL 2"},{"KodeMK":"FI5171","CPMK":"Mampu menunjukkan pengetahuan tentang fabrikasi dalam skala Nano dan alat karakterisasi untuk Nanoteknologi.","KodeCPL":"CPL 5"},{"KodeMK":"FI5171","CPMK":"Mampu bekerja secara efektif, baik secara individu maupun dalam grup.","KodeCPL":"CPL 3"},{"KodeMK":"FI5171","CPMK":"Mampu menunjukkan pengetahuan tentang rencana langkah-langkah eksperimental utama dalam pengembangan sensor Nano – mulai dari fabrikasi hingga karakterisasi.","KodeCPL":"CPL 2"},{"KodeMK":"FI6171","CPMK":"Mampu menunjukkan pengetahuan tentang definisi Instrumentasi Analitik","KodeCPL":"CPL 2"},{"KodeMK":"FI6171","CPMK":"Mampu menunjukkan pengetahuan tentang karakteristik dari Instrumentasi Analitik","KodeCPL":"CPL 2"},{"KodeMK":"FI6171","CPMK":"Mampu menunjukkan pengetahuan tentang metode dan prinsip kerja Instrumentasi Analitik","KodeCPL":"CPL 5"},{"KodeMK":"FI6171","CPMK":"Mampu menunjukkan pengetahuan tentang Aplikasi Instrumentasi Analitik","KodeCPL":"CPL 2"},{"KodeMK":"FI6171","CPMK":"Mampu menunjukkan pengetahuan tentang rencana langkah-langkah eksperimental utama dalam pengembangan Instrumentasi Analitik","KodeCPL":"CPL 3"},{"KodeMK":"FI5141","CPMK":"Mampu memahami konsep dan prinsip dasar cara kerja reaktor nuklir","KodeCPL":"CPL 1"},{"KodeMK":"FI5141","CPMK":"Mampu memahami model-model matematis fisika reaktor sebagai tools untuk melakukan desain dan analisa reaktor nuklir","KodeCPL":"CPL 2"},{"KodeMK":"FI5141","CPMK":"Mampu memecahkan persamaan integral/diferensial yang berkaitan dengan Analisa reaktor nuklir, baik secara analitik maupun numerik/komputasi.","KodeCPL":"CPL 5"},{"KodeMK":"FI5151","CPMK":"Mampu mengikuti perkembangan terakhir (state of the art) dalam bidang fisika radiasi yang dipraktekkan di rumah sakit untuk penyebuhan kanker.","KodeCPL":"CPL 4"},{"KodeMK":"FI5151","CPMK":"Memahami keterkaitan antara bidang fisika radiasi dengan bidang-bidang keilmuan lainnya seperti bidang ongkologi, diagnostik, instrumentasi","KodeCPL":"CPL 2"},{"KodeMK":"FI5241","CPMK":"Mampu menjelaskan hal-hal yang penting tentang ukuran dan bentuk inti partikel elementer serta metode pengukurannya.","KodeCPL":"CPL 1"},{"KodeMK":"FI5241","CPMK":"Mampu menjelaskan teori dan pemecahan numerik untuk persoalan fisika nuklir","KodeCPL":"CPL 5"},{"KodeMK":"FI5241","CPMK":"Mampu menurunkan rumus dasar semi empiris dan mengaplikasikannya","KodeCPL":"CPL 2"},{"KodeMK":"FI5241","CPMK":"Mampu menjelaskan teori reaksi inti dan memecahkan persoalan standar secara analitik dan numerik","KodeCPL":"CPL 2"},{"KodeMK":"FI5241","CPMK":"Mampu menjelaskan teori makroskopik untuk inti dan strategi komputasinya.","KodeCPL":"CPL 1"},{"KodeMK":"FI5251","CPMK":"Mampu mengikuti perkembangan terakhir bidang fisika radiasi yang dipraktekkan untuk kesehatan baik di rumah sakit maupun dalam kehidupan sehari-hari.","KodeCPL":"CPL 4"},{"KodeMK":"FI5251","CPMK":"Memahami hubungan antara bidang fisika radiasi dengan bidang-bidang keilmuan lainnya seperti bidang kedokteran (onkologi, terapi, dan diagnostik) bidang pangan, dan bidang lainnya yang relavan.","KodeCPL":"CPL 2"},{"KodeMK":"FI6151","CPMK":"Mampu memahami konsep dan prinsip keilmuan Fisika Nuklir","KodeCPL":"CPL 1"},{"KodeMK":"FI6151","CPMK":"Mampu memahami permasalahan dan perkembangan terbaru dalam bidang Fisika Nuklir","KodeCPL":"CPL 2"},{"KodeMK":"FI6151","CPMK":"Mampu mengembangkan metoda baru atau metoda kreatif dan inovatif dalam menyelesaikan permasalahan dalam bidang Fisika Nuklir","KodeCPL":"CPL 4"},{"KodeMK":"FI6151","CPMK":"Mampu bekerja mandiri maupun dalam tim untuk menyelesaikan sebuah topik dalam topik khusus Fisika Nuklir","KodeCPL":"CPL 3"},{"KodeMK":"FI6251","CPMK":"Mampu mengikuti perkembangan terakhir (state of the art) dalam bidang ilmu dan teknologi biofisika radiasi dan aplikasinya","KodeCPL":"CPL 4"},{"KodeMK":"FI6251","CPMK":"Memahami keterkaitan antara bidang terkait biofisika terkini dari proses fisika biosistem","KodeCPL":"CPL 2"},{"KodeMK":"FI6251","CPMK":"Memahami proses fisika medis lanjut untuk diagnostik dan terapi","KodeCPL":"CPL 2"},{"KodeMK":"FI6251","CPMK":"Memahami Aspek biomaterial lanjut terkait nano-biomaterial dan biomaterial polimerik","KodeCPL":"CPL 4"},{"KodeMK":"FI6251","CPMK":"Memahami aplikasi biofisika lanjut baik di ilmu dasar dan aplikasi di industri","KodeCPL":"CPL 4"},{"KodeMK":"FI5131","CPMK":"Mampu menjelaskan sifat-sifat material elektronik, seperti: sifat listrik, optik, dan termal dari semikonduktor, isolator, dan konduktor, serta aplikasi mereka dalam perangkat elektronik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5131","CPMK":"Mampu menjelaskan proses fabrikasi yang digunakan dalam pembuatan material elektronik.","KodeCPL":"CPL 2"},{"KodeMK":"FI5131","CPMK":"Mampu menjelaskan prinsip kerjanya dioda, transistor, sensor, dan perangkat lainnya,","KodeCPL":"CPL 1"},{"KodeMK":"FI5131","CPMK":"Mampu mengidentifikasi jenis-jenis ikatan kimia pada sebuah material, menghubungkan struktur elektronik dengan sifat-sifat dasar material serta mampu menganalisis secara kuantitatif.","KodeCPL":"CPL 2"},{"KodeMK":"FI5131","CPMK":"Mampu menjelaskan bagaimana material elektronik digunakan dalam berbagai aplikasi industri seperti perangkat elektronik konsumen, otomotif, medis, dan lainnya.","KodeCPL":"CPL 4"},{"KodeMK":"FI5231","CPMK":"Mampu menjelaskan konsep dasar dalam fisika semikonduktor, termasuk struktur pita energi, konduktivitas, dan efek termoelektrik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5231","CPMK":"Mampu menjelaskan teknik-teknik fabrikasi yang digunakan dalam pembuatan material semikonduktor.","KodeCPL":"CPL 2"},{"KodeMK":"FI5231","CPMK":"Mampu menjelaskan teknik karakterisasi yang digunakan untuk menganalisis sifat-sifat material semikonduktor.","KodeCPL":"CPL 1"},{"KodeMK":"FI5231","CPMK":"Mampu menjelaskan aplikasi material semikonduktor dalam teknologi modern.","KodeCPL":"CPL 4"},{"KodeMK":"FI6131","CPMK":"Memahami konsep dan prinsip-prinsip dasar dalam komputasi material maju.","KodeCPL":"CPL 1"},{"KodeMK":"FI6131","CPMK":"Memahami metode simulasi yang digunakan dalam komputasi material, termasuk metode ab initio, molecular dynamic, dan integrated modelling.","KodeCPL":"CPL 5"},{"KodeMK":"FI6131","CPMK":"Mampu menjelaskan komputasi material digunakan dalam penemuan dan desain material baru.","KodeCPL":"CPL 5"},{"KodeMK":"FI6131","CPMK":"Memahami tantangan dan prospek dalam pengembangan komputasi material meliputi skalabilitas, akurasi, dan validasi model, serta peran komputasi material dalam inovasi dan penelitian material maju.","KodeCPL":"CPL 4"},{"KodeMK":"FI6231","CPMK":"Mampu menjelaskan fungsionalisasi material maju, yang melibatkan modifikasi struktur dan sifat material untuk tujuan tertentu.","KodeCPL":"CPL 1"},{"KodeMK":"FI6231","CPMK":"Mampu menjelaskan berbagai metode yang digunakan dalam proses fungsionalisasi material.","KodeCPL":"CPL 1"},{"KodeMK":"FI6231","CPMK":"Mampu menjelaskan aplikasi fungsionalisasi material dalam industri.","KodeCPL":"CPL 4"},{"KodeMK":"FI6231","CPMK":"Memahami tantangan dan prospek dalam pengembangan fungsionalisasi material.","KodeCPL":"CPL 4"},{"KodeMK":"FI5004","CPMK":"Mahasiswa memahami dasar-dasar teori kinetik, perumusan persamaan transport Boltzmann, dalil H Boltzmann dan analysisnya, gejala transport, hukum kekekalan, solusi dan penerapannya","KodeCPL":"CPL 1"},{"KodeMK":"FI5004","CPMK":"Mahasiswa memahami konsep ensembel dan menggunakannya pada gas ideal","KodeCPL":"CPL 2"},{"KodeMK":"FI5004","CPMK":"Mahasiswa memahami sistem gas ideal yang memenuhi statistik Fermi dan statistik Bose","KodeCPL":"CPL 2"},{"KodeMK":"FI5004","CPMK":"Mahasiswa memahami gugus Mayer, gas real, sistem Fermi dan sistem Bose","KodeCPL":"CPL 2"},{"KodeMK":"FI5004","CPMK":"Mahasiswa memahami Topik Khusus: model Ising, berbagai metoda aproksimasi dan metoda eksak, transisi fasa paramagnetik-feromagnetik, gas kisi, spin glass dan jaringan neural","KodeCPL":"CPL 4"},{"KodeMK":"FI5005","CPMK":"Mahasiswa memahami teknik dasar pemodelan dan simulasi sistem fisis","KodeCPL":"CPL 5"},{"KodeMK":"FI5005","CPMK":"Mahasiswa dapat memecahkan persamaan diferensial secara numerik","KodeCPL":"CPL 5"},{"KodeMK":"FI5005","CPMK":"Mahasiswa mampu memahami simulasi sistem fisis klasik berbasis dinamika molekuler","KodeCPL":"CPL 5"},{"KodeMK":"FI5005","CPMK":"Mahasiswa mengenal mengenai pembelajaran mesin dan aplikasinya pada sistem fisis","KodeCPL":"CPL 5"},{"KodeMK":"FI5005","CPMK":"Mahasiswa dapat mengikuti perkembangan terkini dari topik-topik komputasi dalam fisika","KodeCPL":"CPL 4"},{"KodeMK":"FI5006","CPMK":"Mahasiswa mampu memahami prinsip-prinsip dasar instrumentasi","KodeCPL":"CPL 2"},{"KodeMK":"FI5006","CPMK":"Mahasiswa mampu merancang instrumentasi untuk sistem fisis","KodeCPL":"CPL 3"},{"KodeMK":"FI5006","CPMK":"Mahasiswa dapat mengikuti perkembangan terkini dari topik-topik instrumentasi untuk sistem fisis","KodeCPL":"CPL 4"},{"KodeMK":"FI6172","CPMK":"Memahami perkembangan sistem instrumentasi terkini serta sistem kontrol","KodeCPL":"CPL 4"},{"KodeMK":"FI6172","CPMK":"Memahami perkembangan sensor dan aplikasinya di banyak bidang","KodeCPL":"CPL 4"},{"KodeMK":"FI6172","CPMK":"Memahami peran komputasi dalam pengembangan ilmu fisika","KodeCPL":"CPL 5"},{"KodeMK":"FI6271","CPMK":"Memahami perkembangan instrumentasi dan komputasi terkini dan peranan ilmu fisika dalam prosesnya","KodeCPL":"CPL 1"},{"KodeMK":"FI6271","CPMK":"Mengaplikasikan Fisika untuk pengembangan instrimentasi dan komputasi","KodeCPL":"CPL 4"},{"KodeMK":"FI5007","CPMK":"Mampu memahami konsep digital, model dan strategi untuk berkomunikasi, berkolaborasi, melakukan penelusuran, mengkonsumsi, membuat, dan mendistribusikan informasi dalam dunia digital secara efektif dan positif","KodeCPL":"CPL 4"},{"KodeMK":"FI5007","CPMK":"Mampu memanfaatkan digital tools secara efektif dan positif","KodeCPL":"CPL 5"},{"KodeMK":"FI5007","CPMK":"Mampu memahami prinsip-prinsip literasi data, artificial intellegence, machine learning dan deep learning","KodeCPL":"CPL 5"},{"KodeMK":"FI5007","CPMK":"Mampu menghayati, menghormati, dan menegakkan integritas dan etika akademik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5007","CPMK":"Mampu menghayati, menghormati, dan menegakkan integritas dan etika dalam melakukan riset. proyek, dan publikasi ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI5008","CPMK":"Mahasiswa memahami nature dan tujuan penelitian, konsep dan elemen metodologi penelitian","KodeCPL":"CPL 1"},{"KodeMK":"FI5008","CPMK":"Mahasiswa mampu menentukan topik penelitian, mengidentifikasi dan merumuskan masalah, menentukan kebaruan dan/atau nilai inovatif penelitian","KodeCPL":"CPL 3"},{"KodeMK":"FI5008","CPMK":"Mahasiswa mampu menentukan research question, hipotesa, dan merancang penelitian untuk tugas akhir magisternya","KodeCPL":"CPL 3"},{"KodeMK":"FI5008","CPMK":"Mahasiswa mampu merancang eksperimen atau metode pemerolehan data lainnya sesuai dengan nature keilmuannya","KodeCPL":"CPL 5"},{"KodeMK":"FI5008","CPMK":"Mahasiswa mampu mengolah data, menganalisis dan melakukan pembahasan serta kesimpulan dari hasil penelitian yang diperoleh","KodeCPL":"CPL 5"},{"KodeMK":"FI5008","CPMK":"Mahasiswa mampu menyusun suatu laporan ilmiah","KodeCPL":"CPL 3"},{"KodeMK":"FI6003","CPMK":"Mahasiswa mampu mempersiapkan bahan presentasi tesis/projek yang terstruktur, jelas dan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI6003","CPMK":"Mahasiswa mampu menjelaskan hasil akhir tesis/projek akhirnya dengan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI6001","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6001","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 3"},{"KodeMK":"FI6001","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI6002","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6002","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 3"},{"KodeMK":"FI6002","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI6095","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6095","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 3"},{"KodeMK":"FI6095","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI6096","CPMK":"Mahasiswa mampu meneliti dan mengkaji suatu topik permasalahan dalam kerangka berpikir yang ilmiah","KodeCPL":"CPL 1"},{"KodeMK":"FI6096","CPMK":"Mahasiswa mampu bekerja mandiri, kreatif, inovatif, jujur, kritis dan bertanggung jawab","KodeCPL":"CPL 3"},{"KodeMK":"FI6096","CPMK":"Mahasiswa mampu menerapkan metodologi fisika untuk menyelesaikan masalah secara sistematis dan tepat waktu","KodeCPL":"CPL 2"},{"KodeMK":"FI5091","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5091","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI5093","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5093","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6091","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6091","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6093","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6093","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI5092","CPMK":"Mahasiswa mampu mempersiapkan bahan presentasi penelitan mandiri I yang terstruktur, jelas dan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5092","CPMK":"Mahasiswa mampu menjelaskan hasil akhir presentasi penelitan mandiri I  dengan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5094","CPMK":"Mahasiswa mampu mempersiapkan bahan presentasi penelitan mandiri II yang terstruktur, jelas dan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5094","CPMK":"Mahasiswa mampu menjelaskan hasil akhir presentasi penelitan mandiri II  dengan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI6092","CPMK":"Mahasiswa mampu mempersiapkan bahan presentasi penelitan mandiri III yang terstruktur, jelas dan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI6092","CPMK":"Mahasiswa mampu menjelaskan hasil akhir presentasi penelitan mandiri III  dengan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI6094","CPMK":"Mahasiswa mampu mempersiapkan bahan presentasi penelitan mandiri IV yang terstruktur, jelas dan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI6094","CPMK":"Mahasiswa mampu menjelaskan hasil akhir presentasi penelitan mandiri IV  dengan baik.","KodeCPL":"CPL 1"},{"KodeMK":"FI5261","CPMK":"Mahasiswa mampu memodelkan fungsi respons bumi untuk parameter-parameter fisis (model) serta sumber eksitasi yang berkaitan.","KodeCPL":"CPL 2"},{"KodeMK":"FI5261","CPMK":"Mahasiswa mampu membuat dan menerapkan skema inversi untuk persoalan-persoalan pemodelan kedepan yang telah dibuat dengan bantuan perangkat numerik dan komputasi.","KodeCPL":"CPL 5"},{"KodeMK":"FI5261","CPMK":"Mahasiswa mampu menerapkan teori chaos dan analisis fraktal untuk memahami perilaku kompleks dalam sistem Bumi.","KodeCPL":"CPL 2"},{"KodeMK":"FI5261","CPMK":"Mahasiswa mampu menerapkan konsep pemodelan dan inversi pada persoalan real di lapangan untuk keperluan interpretasi sifat fisis struktur bumi berdasarkan respons pengukuran (data observasi)","KodeCPL":"CPL 4"},{"KodeMK":"FI5272","CPMK":"Mampu merumuskan dan memecahkan masalah dalam sistem instrumen cerdas menggunakan pendekatan sistematis dan logis.","KodeCPL":"CPL 1"},{"KodeMK":"FI5272","CPMK":"Mampu menunjukkan kepekaan terhadap kepentingan masyarakat dan lingkungan dalam merancang dan mengimplementasikan sistem instrumen cerdas.","KodeCPL":"CPL 1"},{"KodeMK":"FI5272","CPMK":"Mampu menerapkan konsep dan prinsip fisika dalam merancang dan mengimplementasikan sistem instrumen cerdas secara kreatif.","KodeCPL":"CPL 2"},{"KodeMK":"FI5272","CPMK":"Mampu menyelesaikan masalah non-rutin dalam sistem instrumen cerdas dengan menerapkan konsep dan prinsip fisika.","KodeCPL":"CPL 2"},{"KodeMK":"FI5272","CPMK":"Mampu menggunakan teknologi informasi dalam merancang dan mengimplementasikan sistem instrumen cerdas.","KodeCPL":"CPL 5"},{"KodeMK":"FI5272","CPMK":"Mampu menerapkan metode komputasi dalam merancang dan mengimplementasikan sistem instrumen cerdas.","KodeCPL":"CPL 5"},{"KodeMK":"FI6004","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6004","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6005","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6005","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI5101","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5101","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI5102","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5102","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI5201","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5201","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI5202","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI5202","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6101","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6101","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6102","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6102","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6201","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6201","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6202","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan fisika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6202","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai suatu topik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6006","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan mekanika analitik atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6006","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai mekanika analitik secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6007","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan mekanika kuantum atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6007","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai mekanika kuantum secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6008","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan elektrodinamika atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6008","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai elektrodinamika secara mandiri","KodeCPL":"CPL 1"},{"KodeMK":"FI6009","CPMK":"Mahasiswa mampu berkreasi dan berinovasi untuk mengembangkan pengetahuan mekanika statistik atau yang terkait secara mandiri","KodeCPL":"CPL 2"},{"KodeMK":"FI6009","CPMK":"Mahasiswa mampu membuat suatu makalah atau laporan yang sistematis mengenai mekanika statistik secara mandiri","KodeCPL":"CPL 1"}]